# NLQ to SQL Query Translator: Evaluation

This notebook contains our code to evaluate our Natural Language Query (NLQ) to Structured Query Language (SQL) generator. It requires functions from the nlq2sql and sqlExtract classes. It also assumes spaCy is already installed as spaCy comes pre-installed in the Google Colab environment.

Note: change file paths wherever appropriate to avoid errors.

# General Setup

We mount this notebook so that it can access Google Drive.

In [1]:
from google.colab import drive
drive.mount('/content/drive/')

Mounted at /content/drive/

We install dependencies and load the WikiSQL dataset.

In [2]:
!pip install datasets

Installing collected packages: pyarrow-hotfix, dill, multiprocess, datasets
Successfully installed datasets-2.15.0 dill-0.3.7 multiprocess-0.70.15 pyarrow-hotfix-0.6

In [3]:
from tqdm import tqdm
from datasets import load_dataset

In [4]:
dataset = load_dataset('wikisql')

Downloading builder script:   0%|          | 0.00/6.57k [00:00<?, ?B/s]

Downloading metadata:   0%|          | 0.00/2.76k [00:00<?, ?B/s]

Downloading readme:   0%|          | 0.00/7.80k [00:00<?, ?B/s]

Downloading data:   0%|          | 0.00/26.2M [00:00<?, ?B/s]

Generating test split:   0%|          | 0/15878 [00:00<?, ? examples/s]

Generating validation split:   0%|          | 0/8421 [00:00<?, ? examples/s]

Generating train split:   0%|          | 0/56355 [00:00<?, ? examples/s]

The cell below describes the format of the WikiSQL dataset. Each row has an NLQ, the corresponding SQL query, and a set of attributes (column names of the table).

In [5]:
question = dataset ['train'][0]['question']
sqlQuery = dataset ['train'][0]['sql']['human_readable']
columns = dataset ['train'][0]['table']['header']

print("NLQ:", question)
print("SQL Query:", sqlQuery)
print("Columns/Attributes:", columns)

print('Train length:', len(dataset['train']))
print('Validation length:', len(dataset['validation']))
print('Test length:', len(dataset['test']))

NLQ: Tell me what the notes are for South Australia
SQL Query: SELECT Notes FROM table WHERE Current slogan = SOUTH AUSTRALIA
Columns/Attributes: ['State/territory', 'Text/background colour', 'Format', 'Current slogan', 'Current series', 'Notes']
Train length: 56355
Validation length: 8421
Test length: 15878

We import the nlq2sql class for evaluation and the sqlExtract class functions to extract attributes and values from SQL queries during evaluation.

In [6]:
%load_ext autoreload
%autoreload 2

from nlq2sql import *
from sqlExtract import *

The cell below shows an example usage of the sqlExtract's fetch where and select attributes functions.

In [7]:
sqlQuery = "SELECT COUNT Date,temp FROM table WHERE Location = davos AND Time > 45.7"
sqlExtractor = sqlExtract(sqlQuery)
whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()
print("Where Attributes:", whereAttr)
print("Where Attributes w/ Corresponding Values:", whereAttrValue)
print("Select Attributes:", sqlExtractor.fetch_select_attr())

Where Attributes: ['Location', 'Time']
Where Attributes w/ Corresponding Values: {'Location': 'davos', 'Time': '45.7'}
Select Attributes: {'Date': 'COUNT', 'temp': ''}

# Filter Test Data for Evaluation

We define filter functions to be those functions that help us filter our dataset to evaluate our model only on a specific subset of queries at a time. These functions also helped us analyze the intricacies of our model to understand its strengths and weaknesses. They also helped us develop our model iteratively so that it can gradually increase its complexity. Each filter function's condition is defined in the function's docstring.

In [8]:
def is_select_not_present_in_nlq(selectAttr, question):
  """Return true if the select attribute is not explicitly present in the NLQ."""
  # assume all the select attributes are explicitly present in the nlq
  for attr in selectAttr.keys():
    idx = question.lower().find(attr.lower())
    if attr != '*' and idx == -1:
        return True
    endIdx = idx + len(attr.lower()) - 1
    # if part of the select attr was found in the query, the character after
    # it (if exists) would not be a whitespace but would be an alphanum char
    if endIdx + 1 < len(question) and question[endIdx + 1].isalnum():
      return True
  return False

In [9]:
selectAttr = {'Start': ''}
question = "Where was the starting position when there were 182 laps?"
print(is_select_not_present_in_nlq(selectAttr, question))

True

In [10]:
def is_invalid_num_select_attr(selectAttr):
  """Return true if more than one attribute has to be selected."""
  return len(selectAttr) > 1

In [11]:
def is_invalid_constraint(sqlQuery):
  """Return true if an operator other than the = is used."""
  for char in ['<', '>', '>=', '<=', '!=', '<>']:
    if char in sqlQuery:
      return True
  return False

In [12]:
def is_invalid_num_where_attr(whereAttr):
  """Return true if more than one attribute has a constraint."""
  return len(whereAttr) > 1

In [13]:
def spaces_in_attr(iterable):
  """Return true if there is a space in the given set of attributes."""
  for attr in iterable:
    if ' ' in attr:
      return True
  return False

In [14]:
def attr_not_present_in_nlq(whereAttrValue, question):
  """Return true if the given set of attributes are not explicitly present in the NLQ."""
  for attr, value in whereAttrValue.items():
    idx = question.lower().find(attr.lower())
    if idx == -1:
      return True
    endIdx = idx + len(attr.lower()) - 1
    if endIdx + 1 < len(question) and question[endIdx + 1].isalnum():
      return True
  return False

The is_aggregate filter function filters out queries with aggregate function keywords in SQL. These keywords are always in uppercase in the SQL queries of the WikiSQL dataset due to which the function assumes the same.

In [15]:
def is_aggregate(sqlQuery):
  """Return true if an aggregate keyword exists in the NLQ."""
  aggr = ['MAX', 'MIN', 'SUM', 'COUNT', 'AVG']
  for agg in aggr:
    if agg in sqlQuery.split():
      return True
  return False

The filter function below checks if a value is not explicitly present in the NLQ. This is only true for a very few poorly formatted queries (about 20 out of 15,000 in the test set). We apply this filter by default to the test split of WikiSQL.

In [16]:
def value_not_present_in_nlq(whereAttrValue, question):
  """Return true if the values are not explicity present in the NLQ."""
  for attr, value in whereAttrValue.items():
      if question.lower().find(value.lower()) == -1:
        return True
  return False

Some NLQs had a thin space instead of a white space in the WikiSQL dataset which negatively affected the accuracy of our named-entity recognition (NER) model, so we are replacing them in the function below.

In [17]:
def remove_unicode_characters(text):
  # replace thin space with normal space
  return text.replace("\u2009", " ")

In the cell below, we define a function apply our desired filters and extract a partition of the WikiSQL test split to evaluate our model on.

In [18]:
def filter_test_data(filters={}):
  validFilters = {'is_select_not_present_in_nlq',
                   'is_invalid_num_select_attr',
                   'is_invalid_constraint',
                   'is_invalid_num_where_attr',
                   'spaces_in_select_attr',
                   'spaces_in_where_attr',
                   'attr_not_present_in_nlq',
                   'is_aggregate'}
  for filter in filters:
    assert filter in validFilters
  tagTestSet= []
  i = 0
  for row in tqdm(dataset['test']):
    question = row['question']
    sqlQuery = row['sql']['human_readable']
    columns = row['table']['header']
    question = remove_unicode_characters(question)
    sqlQuery = remove_unicode_characters(sqlQuery)
    sqlExtractor = sqlExtract(sqlQuery)
    for i in range(len(columns)):
      columns[i] = remove_unicode_characters(columns[i])
    selectAttr = sqlExtractor.fetch_select_attr()
    if 'is_select_not_present_in_nlq' in filters and is_select_not_present_in_nlq(selectAttr, question):
      continue
    if 'is_invalid_num_select_attr' in filters and is_invalid_num_select_attr(selectAttr):
      continue
    if 'is_invalid_constraint' in filters and is_invalid_constraint(sqlQuery):
      continue
    if 'is_aggregate' in filters and is_aggregate(sqlQuery):
      continue
    if 'spaces_in_select_attr' in filters and spaces_in_attr(selectAttr):
      continue
    if 'WHERE' in sqlQuery:
      whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()
      if 'is_invalid_num_where_attr' in filters and is_invalid_num_where_attr(whereAttr):
        continue
      if 'attr_not_present_in_nlq' in filters and attr_not_present_in_nlq(whereAttrValue, question):
        continue
      if 'spaces_in_where_attr' in filters and spaces_in_attr(whereAttr):
        continue
      if value_not_present_in_nlq(whereAttrValue, question):
        continue
    tagTestSet.append({'question': question, 'sqlQuery': sqlQuery, 'attr': columns})
  print(len(tagTestSet))
  return tagTestSet

The obtain_aggregate_queries function obtains aggregate queries with some default filters applied: Values and SELECT/WHERE attributes are explicitly present in the NLQ.

In [19]:
def obtain_aggregate_queries():
  tagTestSet= []
  i = 0
  for row in tqdm(dataset['test']):
    question = row['question']
    sqlQuery = row['sql']['human_readable']
    columns = row['table']['header']
    question = remove_unicode_characters(question)
    sqlQuery = remove_unicode_characters(sqlQuery)
    sqlExtractor = sqlExtract(sqlQuery)
    addedIndicator = False
    for i in range(len(columns)):
      columns[i] = remove_unicode_characters(columns[i])
    selectAttr = sqlExtractor.fetch_select_attr()
    if is_select_not_present_in_nlq(selectAttr, question):
      continue
    if 'WHERE' in sqlQuery:
      whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()
      if attr_not_present_in_nlq(whereAttrValue, question):
        continue
      if value_not_present_in_nlq(whereAttrValue, question):
        continue
    if is_aggregate(sqlQuery):
      tagTestSet.append({'question': question, 'sqlQuery': sqlQuery, 'attr': columns})
  print(len(tagTestSet))
  return tagTestSet

The obtain_absent_where_attr_queries function obtains queries whose where attributes are not explicitly present in the NLQ with some default filters applied: Values and SELECT attributes are explicitly present in the NLQ.

In [32]:
def obtain_absent_where_attr_queries():
  """Obtain queries where WHERE attr isn't present in the NLQ."""
  tagTestSet= []
  i = 0
  for row in tqdm(dataset['test']):
    question = row['question']
    sqlQuery = row['sql']['human_readable']
    columns = row['table']['header']
    question = remove_unicode_characters(question)
    sqlQuery = remove_unicode_characters(sqlQuery)
    sqlExtractor = sqlExtract(sqlQuery)
    for i in range(len(columns)):
      columns[i] = remove_unicode_characters(columns[i])
    selectAttr = sqlExtractor.fetch_select_attr()
    if is_select_not_present_in_nlq(selectAttr, question):
      continue
    if 'WHERE' in sqlQuery:
      whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()
      if value_not_present_in_nlq(whereAttrValue, question):
        continue
      if attr_not_present_in_nlq(whereAttrValue, question):
        tagTestSet.append({'question': question, 'sqlQuery': sqlQuery, 'attr': columns})
  print(len(tagTestSet))
  return tagTestSet

# Setup Evaluation Helper Functions

We install the large spaCy English model to perform tokenization in nlq2sql and the transformers library to perform custom NER.

In [21]:
import spacy
!python3 -m spacy download en_core_web_lg

Successfully installed en-core-web-lg-3.6.0
✔ Download and installation successful
You can now load the package via spacy.load('en_core_web_lg')

In [ ]:
!pip install spacy-transformers

In [23]:
def ignore_case_and_order(iterable):
  """Return the iterable in lower case as a set."""
  temp = []
  for item in iterable:
    if item is None:
      print(iterable)
    temp.append(item.lower())
  return set(temp)

In [24]:
def ignore_case(dictObj):
  """Return a dict with lower case keys and values."""
  temp = {}
  for key, value in dictObj.items():
    temp[key.lower()] = value.lower()
  return temp

In [25]:
def remove_quotes(sqlQuery):
  """Remove quotes from an SQL query."""
  return sqlQuery.replace('"', '')

The evaluate_data function defined below calculates accuracy on the filtered tagTestSet and prints statistics. It prints the SELECT accuracy, which is calculated as:
$$\frac{\text{#queries with correct SELECT attributes}}{\text{#total queries}}$$
the WHERE accuracy, which is calculated as:
$$\frac{\text{#queries with correct WHERE attributes}}{\text{#total queries}}$$
the Value accuracy, which is calculated as:
$$\frac{\text{#queries with correct Values}}{\text{#total queries}}$$
the Overall accuracy, which is calculated as:
$$\frac{\text{#correct queries}}{\text{#total queries}}$$
Correct queries are those queries with correct SELECT attributes and correct WHERE attributes associated with their correct corresponding values and operators.

It prints a "1" if the SELECT/WHERE attributes and values in the predicted and expected SQL query match. Otherwise, it prints the NLQ, attributes, predicted SQL query, and the expected SQL query. Along with this information, it also prints a progress fraction: $$\frac{\text{#queries completed}}{\text{#total queries}}$$

In [26]:
import spacy_transformers

def evaluate_data(tagTestSet, nlp_ner, rule, nlp_aggr=None):
  """Calculate accuracy on test data and print statistics."""
  numCorrectOverall = 0
  numCorrectSelect = 0
  numCorrectWhere = 0
  numCorrectValues = 0
  nlp = spacy.load("en_core_web_lg")
  i = 0
  for obj in tagTestSet:
      sqlQuery = remove_quotes(obj['sqlQuery'])
      attributes = obj['attr']
      nlq = obj['question']
      nQueryObj = nlq2sql(nlq, "table", attributes, nlp, nlp_ner, rule)
      isSelect = False
      pred = nQueryObj.get_sql_query()
      sqlExtractor = sqlExtract(sqlQuery)
      correctSelectAttr = sqlExtractor.fetch_select_attr()
      if ignore_case(nQueryObj.selectAttributes) == ignore_case(correctSelectAttr):
          numCorrectSelect += 1
          isSelect = True
      correctWhereAttr, whereAttrVals = sqlExtractor.fetch_where_attr()
      if ignore_case_and_order(nQueryObj.whereAttributes.keys()) == ignore_case_and_order(correctWhereAttr):
          numCorrectWhere += 1
      if ignore_case_and_order(nQueryObj.whereAttributes.values()) == ignore_case_and_order(whereAttrVals.values()):
          numCorrectValues += 1
      if isSelect and ignore_case(nQueryObj.whereAttributes) == ignore_case(whereAttrVals):
          numCorrectOverall += 1
          print(f"{i} / {len(tagTestSet)}", 1)
      else:
        print(f"{i} / {len(tagTestSet)}", obj['question'], obj['attr'], pred, sqlQuery)
      i += 1
  print('Select accuracy', (numCorrectSelect / len(tagTestSet)) * 100)
  print('Where accuracy', (numCorrectWhere / len(tagTestSet)) * 100)
  print('Value accuracy', (numCorrectValues / len(tagTestSet)) * 100)
  print('Overall accuracy', (numCorrectOverall / len(tagTestSet)) * 100)

# Evaluation

This section consists of our results from evaluating our NLP to SQL Query translator on various cases which represent specific subsets of queries from the WikiSQL dataset. We have analyzed these results in detail in our final report.

We load 2 models: one that supports tagging SELECT attributes with their corresponding aggregate functions and one that doesn't. The nlp_ner model doesn't support aggregation, that is, it only tags words as "SELECT" or "CONSTRAINT". The nlp_aggr model supports aggregation, that is, it tags words as "COUNT SELECT", "MAX SELECT", "MIN SELECT", "AVG SELECT", "SELECT", and "CONSTRAINT".

In [27]:
nlp_ner = spacy.load("/content/drive/MyDrive/train_spacy/model-best-no-aggr")

In [28]:
nlp_aggr = spacy.load("/content/drive/MyDrive/train_spacy/model-best")

# Case 1: No Aggregation, Attributes Explicitly Present in NLQ, Rule 1

We evaluate accuracy assuming that

*   the SELECT and WHERE attributes are explicitly present in the NLQ
*   there are no aggregate functions like MAX, MIN, COUNT, or others
*   nlq2sql uses rule 1 (defined in our report)

We also assume that there are no WHERE clauses with any operator other than '=' but no such queries exist when we also impose the condition that attributes need to be explicitly present in the NLQ.

The ner model used in the evaluation below doesn't support aggregation.

In [29]:
filters = {'is_select_not_present_in_nlq',
           'is_invalid_constraint',
           'attr_not_present_in_nlq',
           'is_aggregate'}
tagTestSet = filter_test_data(filters)
print(len(tagTestSet))

100%|██████████| 15878/15878 [00:06<00:00, 2383.87it/s]

4855
4855

In [33]:
evaluate_data(tagTestSet, nlp_ner, 'rule1')

0 / 4855 1
1 / 4855 1
2 / 4855 1
3 / 4855 1
4 / 4855 1
5 / 4855 1
6 / 4855 1
7 / 4855 1
8 / 4855 1
9 / 4855 1
10 / 4855 1
11 / 4855 1
12 / 4855 1
13 / 4855 1
14 / 4855 If % lunsford is 51.82% what is the % mcconnell in Letcher? ['County', 'Precincts', 'Lunsford', '% Lunsford', 'McConnell', '% McConnell', 'Total'] SELECT % mcconnell FROM table WHERE lunsford = 51.82% SELECT % McConnell FROM table WHERE % Lunsford = 51.82%
15 / 4855 1
16 / 4855 what's the original air date with title  "hell" ['No. in series', 'No. in season', 'Title', 'Directed by', 'Written by', 'Original air date'] SELECT original air date FROM table WHERE title = "hell" SELECT Original air date FROM table WHERE Title = Hell
17 / 4855 1
18 / 4855 What is the percentage of the  trance- n himalaya zone that corresponds with the high hill zone is 25%? ['Particulars and Characteristics', 'Shivalik Zone', 'Mid-Hill Zone', 'High hill zone', 'Trance- n Himalaya Zone'] SELECT * FROM table WHERE high hill zone = 25% SELECT Trance- n Himalaya Zone FROM table WHERE High hill zone = 25%
19 / 4855 1
20 / 4855 1
21 / 4855 1
22 / 4855 1
23 / 4855 1
24 / 4855 Which song has picturization by only vijay? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT song FROM table WHERE picturization = only vijay SELECT Song FROM table WHERE Picturization = Vijay
25 / 4855 For which singers was Alangudi Somu the lyricist? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT * FROM table WHERE singers = Alangudi Somu SELECT Singers FROM table WHERE Lyricist = Alangudi Somu
26 / 4855 1
27 / 4855 1
28 / 4855 What percentage of The Bronx voters occured when Manhattan had 29.9% of voters? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT The Bronx FROM table WHERE % = 29.9% SELECT The Bronx FROM table WHERE Manhattan = 29.9%
29 / 4855 What number of voters did the Bronx have when the total number was 2054? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE the bronx = voters AND total = 2054 SELECT The Bronx FROM table WHERE Total = 2054
30 / 4855 1
31 / 4855 1
32 / 4855 1
33 / 4855 Which candidate won 88 votes in Queens in 1921? ['1921', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE queens = 88 SELECT 1921 FROM table WHERE Queens = 88
34 / 4855 1
35 / 4855 1
36 / 4855 1
37 / 4855 What are the highest recorded attendance rates of the stadiums with an average attendance of 4752? ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average'] SELECT * FROM table WHERE average = 4752 SELECT Highest FROM table WHERE Average = 4752
38 / 4855 What is the catalog number of the title called "super callanetics"? ['Year', 'Title', 'Format', 'Studio', 'Release Date', 'Copyright Information', 'Catalog Number'] SELECT * FROM table WHERE title = "super callanetics" SELECT Catalog Number FROM table WHERE Title = Super Callanetics
39 / 4855 1
40 / 4855 1
41 / 4855 1
42 / 4855 1
43 / 4855 What is the premiere on the mega channel? ['Country/Region', 'Show Title', 'Languages', 'Host', 'Channel', 'Premiere', 'Seasons', 'Status'] SELECT premiere FROM table WHERE channel = mega SELECT Premiere FROM table WHERE Channel = Mega Channel
44 / 4855 1
45 / 4855 1
46 / 4855 1
47 / 4855 1
48 / 4855 1
49 / 4855 1
50 / 4855 1
51 / 4855 Who was the winning driver when the pole position was held by Ayrton Senna and the Fastest lap was Michael Schumacher? ['Round', 'Grand Prix', 'Pole Position', 'Fastest Lap', 'Winning Driver', 'Winning Constructor', 'Report'] SELECT winning driver FROM table WHERE fastest lap = Michael Schumacher SELECT Winning Driver FROM table WHERE Pole Position = Ayrton Senna AND Fastest Lap = Michael Schumacher
52 / 4855 1
53 / 4855 1
54 / 4855 1
55 / 4855 1
56 / 4855 1
57 / 4855 1
58 / 4855 1
59 / 4855 1
60 / 4855 1
61 / 4855 1
62 / 4855 Which model number has a GVM (kg) Technical Capacity of 16000 and a Torque Nm@rpm of 600 @ 1700? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE model = model number AND gvm (kg) technical capacity = 16000 AND torque nm@rpm = 600 @ 1700 SELECT Model FROM table WHERE GVM (kg) Technical Capacity = 16000 AND Torque Nm@rpm = 600 @ 1700
63 / 4855 If the model is  15.180e, what is the GVM (kg) Technical Capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE model = Technical Capacity SELECT GVM (kg) Technical Capacity FROM table WHERE Model = 15.180E
64 / 4855 When the transmission make/type/speed is eaton fs 5306-a manual synchromesh 6 speed, what is the value of the gcm (kg) technical capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE transmission make/type/speed = technical capacity SELECT GCM (kg) Technical Capacity FROM table WHERE Transmission Make/Type/Speed = Eaton FS 5306-A Manual Synchromesh 6 Speed
65 / 4855 Which model possesses a transmission make/type/speed of eaton fs-6306 a manual synchromesh 6 speed? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT model FROM table WHERE transmission make/type/speed = manual synchromesh 6 SELECT Model FROM table WHERE Transmission Make/Type/Speed = Eaton FS-6306 A Manual Synchromesh 6 Speed
66 / 4855 For driver Mark Skaife what is the result for race 1? ['Driver', 'No.', 'Team', 'Car', 'Race 1', 'GP 100', 'Race 3', 'Points'] SELECT * FROM table WHERE driver = 1 AND race 1 = result SELECT Race 1 FROM table WHERE Driver = Mark Skaife
67 / 4855 1
68 / 4855 1
69 / 4855 1
70 / 4855 1
71 / 4855 1
72 / 4855 1
73 / 4855 1
74 / 4855 1
75 / 4855 1
76 / 4855 1
77 / 4855 1
78 / 4855 1
79 / 4855 1
80 / 4855 1
81 / 4855 1
82 / 4855 1
83 / 4855 1
84 / 4855  what's the introduced where notes is 9 withdrawn in 1946 after fire ['Number Range', 'Introduced', 'Builder', 'Engine', 'Weight (long tons)', 'Seats', 'Withdrawn', 'Notes'] SELECT introduced FROM table WHERE withdrawn = 9 withdrawn in 1946 after fire SELECT Introduced FROM table WHERE Notes = 9 withdrawn in 1946 after fire
85 / 4855 1
86 / 4855 1
87 / 4855 1
88 / 4855 what is the song name for the film name ganga kare insaaf? ['Year', 'Song name', 'Film name', 'Co-singer', 'Music director', 'Lyricist', 'Language'] SELECT * FROM table WHERE film name = ganga kare insaaf SELECT Song name FROM table WHERE Film name = Ganga Kare Insaaf
89 / 4855 1
90 / 4855  what's the electorate where election date is 16 cannot handle non-empty timestamp argument! ['Member', 'Electorate', 'Province', 'MPs term', 'Election date'] SELECT electorate FROM table WHERE election date = 16 cannot handle non-empty timestamp argument SELECT Electorate FROM table WHERE Election date = 16 Cannot handle non-empty timestamp argument!
91 / 4855 1
92 / 4855 1
93 / 4855 1
94 / 4855 1
95 / 4855 1
96 / 4855 How many integrated allied-related are there? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT * FROM table WHERE integrated = integrated allied-related SELECT Integrated FROM table WHERE Allied-Related = Many
97 / 4855 1
98 / 4855 what is the integrated in which the holding allied-unrelated is many? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT integrated FROM table WHERE allied-unrelated = many SELECT Holding FROM table WHERE Allied-Unrelated = Many
99 / 4855 1
100 / 4855 1
101 / 4855 1
102 / 4855 1
103 / 4855 1
104 / 4855 1
105 / 4855 1
106 / 4855 Crockett High School had which number(#)? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT * FROM table WHERE high school = Crockett High School AND # = number SELECT # FROM table WHERE High School = Crockett
107 / 4855 Which home town was the high school Catholic University located in? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT home town FROM table WHERE high school = Catholic SELECT Home Town FROM table WHERE High School = Catholic University
108 / 4855 What height was the forward position at Crockett High School? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT height FROM table WHERE position = forward AND high school = Crockett High School SELECT Height FROM table WHERE Position = Forward AND High School = Crockett
109 / 4855 1
110 / 4855 1
111 / 4855 1
112 / 4855 1
113 / 4855 1
114 / 4855 1
115 / 4855 1
116 / 4855 1
117 / 4855 1
118 / 4855 1
119 / 4855 1
120 / 4855 1
121 / 4855 What is the score for the interview for the state of New York? ['State', 'Preliminaries', 'Interview', 'Swimsuit', 'Evening Gown', 'Average'] SELECT * FROM table WHERE interview = score AND state = New York SELECT Interview FROM table WHERE State = New York
122 / 4855 1
123 / 4855 1
124 / 4855 1
125 / 4855 1
126 / 4855 1
127 / 4855 1
128 / 4855 1
129 / 4855 1
130 / 4855 What is the theme for the episode selection process? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT theme FROM table WHERE episode = selection SELECT Theme FROM table WHERE Episode = Selection Process
131 / 4855 What is the song choice when the theme is not aired? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT song choice FROM table WHERE theme = not aired SELECT Theme FROM table WHERE Song choice = Not Aired
132 / 4855 What years did Markose Bristow Madhumita Bisht win the mens singles and/or the mixed doubles? ['Season', 'Mens singles', 'Womens singles', 'Mens doubles', 'Womens doubles', 'Mixed doubles'] SELECT * FROM table WHERE mens singles = Markose Bristow Madhumita Bisht SELECT Mens singles FROM table WHERE Mixed doubles = Markose Bristow Madhumita Bisht
133 / 4855 What year is Japan the country? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Japan SELECT Year FROM table WHERE Country = Japan
134 / 4855 What is the year that Dewi Claire Schreefel is the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Dewi Claire Schreefel SELECT Year FROM table WHERE Champion = Dewi Claire Schreefel
135 / 4855 What is the tournament location when Vicky Hurst in the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT tournament location FROM table WHERE tournament location = Vicky Hurst SELECT Tournament location FROM table WHERE Champion = Vicky Hurst
136 / 4855 1
137 / 4855 1
138 / 4855 1
139 / 4855 1
140 / 4855 Which is the charity that the background of the celebrity is heavyweight champion? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT charity FROM table WHERE celebrity = heavyweight champion SELECT Charity FROM table WHERE Background = Heavyweight Champion
141 / 4855 1
142 / 4855 1
143 / 4855 1
144 / 4855 What is the background of the celebrity who had the result 13 the celebrity apprentice (2008-03-27)? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT background FROM table WHERE celebrity = celebrity apprentice (2008-03-27) SELECT Background FROM table WHERE Result = 13 The Celebrity Apprentice (2008-03-27)
145 / 4855 1
146 / 4855 1
147 / 4855 1
148 / 4855 1
149 / 4855 1
150 / 4855 1
151 / 4855 1
152 / 4855 1
153 / 4855 1
154 / 4855 1
155 / 4855 What is the 2007 estimate when the rank (csa) is 4 ['Rank (CSA)', 'Combined Statistical Area (or Metropolitan Statistical Area if noted)', 'State(s)', '2007 Estimate', '2000 Population', 'Percent Change (1990–2000)'] SELECT * FROM table WHERE rank (csa) = 4 SELECT 2007 Estimate FROM table WHERE Rank (CSA) = 4
156 / 4855 1
157 / 4855 1
158 / 4855 1
159 / 4855 1
160 / 4855 1
161 / 4855 1
162 / 4855 1
163 / 4855 1
164 / 4855 1
165 / 4855 1
166 / 4855 What was the lost with tries for? ['Club', 'Played', 'Won', 'Drawn', 'Lost', 'Points for', 'Points against', 'Tries for', 'Tries against', 'Try bonus', 'Losing bonus', 'Points'] SELECT lost FROM table SELECT Lost FROM table WHERE Tries for = Tries for
167 / 4855 1
168 / 4855 1
169 / 4855 1
170 / 4855 1
171 / 4855 1
172 / 4855 What is the type of the printer ports included in the EX Plus3 model number? ['Model number', 'Printer ports', 'Network ports', 'Network protocols', 'Firmware', 'Notes'] SELECT * FROM table WHERE printer ports = type AND model number = EX Plus3 SELECT Printer ports FROM table WHERE Model number = EX Plus3
173 / 4855 What is the traditional way to write the name of the district who's area is 2331? ['English Name', 'Simplified', 'Traditional', 'Pinyin', 'Area', 'Population', 'Density'] SELECT * FROM table WHERE area = 2331 SELECT Traditional FROM table WHERE Area = 2331
174 / 4855 1
175 / 4855 1
176 / 4855 1
177 / 4855 1
178 / 4855 1
179 / 4855 1
180 / 4855 What was the air date of part 2 of the episode whose part 1 was aired on January 31, 2008? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 2 FROM table WHERE part 2 = air date AND part 1 = January 31, 2008 SELECT Part 2 FROM table WHERE Part 1 = January 31, 2008
181 / 4855 What's the air date of part 1 of the episode whose part 2 aired on December 2, 2007? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 1 FROM table WHERE part 1 = air date AND part 2 = December 2, 2007 SELECT Part 1 FROM table WHERE Part 2 = December 2, 2007
182 / 4855 1
183 / 4855 1
184 / 4855 1
185 / 4855 1
186 / 4855 1
187 / 4855 1
188 / 4855 1
189 / 4855 1
190 / 4855 1
191 / 4855 1
192 / 4855 Who were the candidates when gregory w. meeks was the incumbent ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT candidates FROM table WHERE candidates = gregory w. meeks SELECT Candidates FROM table WHERE Incumbent = Gregory W. Meeks
193 / 4855 1
194 / 4855 1
195 / 4855 1
196 / 4855 1
197 / 4855 1
198 / 4855 1
199 / 4855 1
200 / 4855 1
201 / 4855 1
202 / 4855 1
203 / 4855 1
204 / 4855 1
205 / 4855 1
206 / 4855 1
207 / 4855 1
208 / 4855 1
209 / 4855 1
210 / 4855 1
211 / 4855 1
212 / 4855 1
213 / 4855 1
214 / 4855 1
215 / 4855 1
216 / 4855 1
217 / 4855 1
218 / 4855 What district is F. Edward Hebert the incumbent in? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = F. Edward Hebert SELECT District FROM table WHERE Incumbent = F. Edward Hebert
219 / 4855 1
220 / 4855 What's the district that Otto Passman is the incumbent of? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Otto Passman SELECT District FROM table WHERE Incumbent = Otto Passman
221 / 4855 1
222 / 4855 1
223 / 4855 1
224 / 4855 1
225 / 4855 1
226 / 4855 1
227 / 4855 1
228 / 4855 1
229 / 4855 1
230 / 4855 1
231 / 4855 1
232 / 4855 1
233 / 4855 1
234 / 4855 What district was Harold Earthman the incumbent in?  ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Harold Earthman SELECT District FROM table WHERE Incumbent = Harold Earthman
235 / 4855 1
236 / 4855 1
237 / 4855 1
238 / 4855 1
239 / 4855 1
240 / 4855 What year was incumbent william f. stevenson first elected? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT first elected FROM table WHERE first elected = william f. stevenson SELECT First elected FROM table WHERE Incumbent = William F. Stevenson
241 / 4855 1
242 / 4855 1
243 / 4855 1
244 / 4855 1
245 / 4855 1
246 / 4855 1
247 / 4855 1
248 / 4855 Pink cytoplasm is seen in a test that specifically stains what? ['Stain', 'Common use', 'Nucleus', 'Cytoplasm', 'Red blood cell (RBC)', 'Collagen fibers', 'Specifically stains'] SELECT * FROM table WHERE cytoplasm = Pink cytoplasm SELECT Specifically stains FROM table WHERE Cytoplasm = Pink
249 / 4855 The pink cytoplasm will have a nucleus of what color? ['Stain', 'Common use', 'Nucleus', 'Cytoplasm', 'Red blood cell (RBC)', 'Collagen fibers', 'Specifically stains'] SELECT nucleus FROM table WHERE cytoplasm = pink cytoplasm SELECT Nucleus FROM table WHERE Cytoplasm = Pink
250 / 4855 where is hte second place winner from united kingdom? ['Year', 'Winner', 'Language', 'Artist', 'Song', 'Points', 'Margin', 'Second place', 'Date', 'Venue', 'Location', 'Participants'] SELECT second place FROM table WHERE winner = united kingdom SELECT Winner FROM table WHERE Second place = United Kingdom
251 / 4855 1
252 / 4855 1
253 / 4855 1
254 / 4855 1
255 / 4855 1
256 / 4855 1
257 / 4855 1
258 / 4855 1
259 / 4855 1
260 / 4855 1
261 / 4855 what's the byu-uu score with uu-usu score being 44–16 ['Season', 'Winner', 'BYU-UU score', 'BYU-USU score', 'UU-USU score'] SELECT * FROM table WHERE uu-usu score = 44–16 SELECT BYU-UU score FROM table WHERE UU-USU score = 44–16
262 / 4855 what's the record with high points being dwyane wade (27) and location attendance being arco arena ['Game', 'Date', 'Team', 'Score', 'High points', 'High rebounds', 'High assists', 'Location Attendance', 'Record'] SELECT record FROM table WHERE location attendance = arco arena SELECT Record FROM table WHERE High points = Dwyane Wade (27) AND Location Attendance = ARCO Arena
263 / 4855 1
264 / 4855 1
265 / 4855 1
266 / 4855 1
267 / 4855 1
268 / 4855 1
269 / 4855 what's the district with party being republican and elected being 1998 ['District', 'Incumbent', 'Party', 'Elected', 'Status', 'Opponent'] SELECT district FROM table WHERE elected = 1998 SELECT District FROM table WHERE Party = Republican AND Elected = 1998
270 / 4855 1
271 / 4855 1
272 / 4855 1
273 / 4855 1
274 / 4855 1
275 / 4855 1
276 / 4855 1
277 / 4855 1
278 / 4855 what's the result with opponent being at oakland raiders ['Week', 'Date', 'Opponent', 'Result', 'Stadium', 'Record', 'Attendance'] SELECT result FROM table WHERE opponent = oakland raiders SELECT Result FROM table WHERE Opponent = at Oakland Raiders
279 / 4855 1
280 / 4855 1
281 / 4855 The results for gt2 winning team is all lars-erik nielsen allan simonsen richard westbrook.  ['Rnd', 'Circuit', 'LMP1 Winning Team', 'LMP2 Winning Team', 'GT1 Winning Team', 'GT2 Winning Team', 'Results'] SELECT results FROM table WHERE gt2 winning team = all lars-erik nielsen allan simonsen richard westbrook SELECT Results FROM table WHERE GT2 Winning Team = Lars-Erik Nielsen Allan Simonsen Richard Westbrook
282 / 4855 1
283 / 4855 1
284 / 4855 1
285 / 4855 1
286 / 4855 1
287 / 4855 1
288 / 4855 1
289 / 4855 1
290 / 4855 1
291 / 4855 1
292 / 4855 1
293 / 4855 1
294 / 4855 picturesque and trekking route is the category what is the height from sea level in meters? ['Name Of Place', 'Height from Sea Level In Meters', 'Nearby Town', 'Trekking Route', 'Category'] SELECT height from sea level in meters FROM table WHERE trekking route = picturesque and trekking route SELECT Height from Sea Level In Meters FROM table WHERE Category = Picturesque and Trekking Route
295 / 4855 1
296 / 4855 1
297 / 4855 1
298 / 4855 1
299 / 4855 When the total points are 22 how many total touchdowns have been made? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table WHERE points = 22 AND touchdowns = total touchdowns SELECT Touchdowns FROM table WHERE Points = 22
300 / 4855 1

Our accuracy statistics for this case is as follows.

*   Select accuracy: 95.43%
*   Where accuracy: 85.81%
*   Value accuracy: 90.94%
*   Overall accuracy 80.86%

# Case 2: No Aggregation, Attributes Explicitly Present in NLQ, Rule 2

We evaluate accuracy with the same conditions as before, but nlq2sql uses rule 2 instead (defined in our report).

In [34]:
evaluate_data(tagTestSet, nlp_ner, 'rule2')

0 / 4855 1
1 / 4855 1
2 / 4855 1
3 / 4855 1
4 / 4855 1
5 / 4855 1
6 / 4855 1
7 / 4855 1
8 / 4855 1
9 / 4855 1
10 / 4855 1
11 / 4855 1
12 / 4855 1
13 / 4855 1
14 / 4855 1
15 / 4855 1
16 / 4855 what's the original air date with title  "hell" ['No. in series', 'No. in season', 'Title', 'Directed by', 'Written by', 'Original air date'] SELECT original air date FROM table WHERE original air date = "hell" SELECT Original air date FROM table WHERE Title = Hell
17 / 4855 1
18 / 4855 What is the percentage of the  trance- n himalaya zone that corresponds with the high hill zone is 25%? ['Particulars and Characteristics', 'Shivalik Zone', 'Mid-Hill Zone', 'High hill zone', 'Trance- n Himalaya Zone'] SELECT * FROM table WHERE trance- n himalaya zone = trance- n himalaya AND high hill zone = 25% SELECT Trance- n Himalaya Zone FROM table WHERE High hill zone = 25%
19 / 4855 1
20 / 4855 1
21 / 4855 1
22 / 4855 1
23 / 4855 1
24 / 4855 Which song has picturization by only vijay? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT song FROM table WHERE picturization = only vijay SELECT Song FROM table WHERE Picturization = Vijay
25 / 4855 For which singers was Alangudi Somu the lyricist? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT * FROM table WHERE singers = Alangudi Somu SELECT Singers FROM table WHERE Lyricist = Alangudi Somu
26 / 4855 1
27 / 4855 1
28 / 4855 What percentage of The Bronx voters occured when Manhattan had 29.9% of voters? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT The Bronx FROM table WHERE % = 29.9% SELECT The Bronx FROM table WHERE Manhattan = 29.9%
29 / 4855 What number of voters did the Bronx have when the total number was 2054? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE the bronx = Bronx AND total = 2054 SELECT The Bronx FROM table WHERE Total = 2054
30 / 4855 1
31 / 4855 1
32 / 4855 1
33 / 4855 Which candidate won 88 votes in Queens in 1921? ['1921', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE queens = 88 SELECT 1921 FROM table WHERE Queens = 88
34 / 4855 1
35 / 4855 1
36 / 4855 1
37 / 4855 What are the highest recorded attendance rates of the stadiums with an average attendance of 4752? ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average'] SELECT * FROM table WHERE average = 4752 SELECT Highest FROM table WHERE Average = 4752
38 / 4855 What is the catalog number of the title called "super callanetics"? ['Year', 'Title', 'Format', 'Studio', 'Release Date', 'Copyright Information', 'Catalog Number'] SELECT * FROM table WHERE catalog number = "super callanetics" SELECT Catalog Number FROM table WHERE Title = Super Callanetics
39 / 4855 1
40 / 4855 1
41 / 4855 1
42 / 4855 1
43 / 4855 What is the premiere on the mega channel? ['Country/Region', 'Show Title', 'Languages', 'Host', 'Channel', 'Premiere', 'Seasons', 'Status'] SELECT premiere FROM table WHERE channel = mega SELECT Premiere FROM table WHERE Channel = Mega Channel
44 / 4855 1
45 / 4855 1
46 / 4855 1
47 / 4855 1
48 / 4855 1
49 / 4855 1
50 / 4855 1
51 / 4855 Who was the winning driver when the pole position was held by Ayrton Senna and the Fastest lap was Michael Schumacher? ['Round', 'Grand Prix', 'Pole Position', 'Fastest Lap', 'Winning Driver', 'Winning Constructor', 'Report'] SELECT winning driver FROM table WHERE fastest lap = Michael Schumacher SELECT Winning Driver FROM table WHERE Pole Position = Ayrton Senna AND Fastest Lap = Michael Schumacher
52 / 4855 1
53 / 4855 1
54 / 4855 1
55 / 4855 1
56 / 4855 1
57 / 4855 1
58 / 4855 1
59 / 4855 1
60 / 4855 1
61 / 4855 1
62 / 4855 Which model number has a GVM (kg) Technical Capacity of 16000 and a Torque Nm@rpm of 600 @ 1700? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE model = model number AND gvm (kg) technical capacity = 16000 AND torque nm@rpm = 600 @ 1700 SELECT Model FROM table WHERE GVM (kg) Technical Capacity = 16000 AND Torque Nm@rpm = 600 @ 1700
63 / 4855 If the model is  15.180e, what is the GVM (kg) Technical Capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE model = Technical Capacity SELECT GVM (kg) Technical Capacity FROM table WHERE Model = 15.180E
64 / 4855 When the transmission make/type/speed is eaton fs 5306-a manual synchromesh 6 speed, what is the value of the gcm (kg) technical capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE transmission make/type/speed = technical capacity SELECT GCM (kg) Technical Capacity FROM table WHERE Transmission Make/Type/Speed = Eaton FS 5306-A Manual Synchromesh 6 Speed
65 / 4855 Which model possesses a transmission make/type/speed of eaton fs-6306 a manual synchromesh 6 speed? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT model FROM table WHERE transmission make/type/speed = manual synchromesh 6 SELECT Model FROM table WHERE Transmission Make/Type/Speed = Eaton FS-6306 A Manual Synchromesh 6 Speed
66 / 4855 For driver Mark Skaife what is the result for race 1? ['Driver', 'No.', 'Team', 'Car', 'Race 1', 'GP 100', 'Race 3', 'Points'] SELECT * FROM table WHERE driver = 1 AND race 1 = result SELECT Race 1 FROM table WHERE Driver = Mark Skaife
67 / 4855 1
68 / 4855 1
69 / 4855 1
70 / 4855 1
71 / 4855 1
72 / 4855 1
73 / 4855 1
74 / 4855 1
75 / 4855 1
76 / 4855 1
77 / 4855 1
78 / 4855 1
79 / 4855 1
80 / 4855 1
81 / 4855 1
82 / 4855 1
83 / 4855 1
84 / 4855  what's the introduced where notes is 9 withdrawn in 1946 after fire ['Number Range', 'Introduced', 'Builder', 'Engine', 'Weight (long tons)', 'Seats', 'Withdrawn', 'Notes'] SELECT introduced FROM table WHERE withdrawn = 9 withdrawn in 1946 after fire SELECT Introduced FROM table WHERE Notes = 9 withdrawn in 1946 after fire
85 / 4855 1
86 / 4855 1
87 / 4855 1
88 / 4855 what is the song name for the film name ganga kare insaaf? ['Year', 'Song name', 'Film name', 'Co-singer', 'Music director', 'Lyricist', 'Language'] SELECT * FROM table WHERE song name = song AND film name = ganga kare insaaf SELECT Song name FROM table WHERE Film name = Ganga Kare Insaaf
89 / 4855 1
90 / 4855  what's the electorate where election date is 16 cannot handle non-empty timestamp argument! ['Member', 'Electorate', 'Province', 'MPs term', 'Election date'] SELECT electorate FROM table WHERE electorate = 16 cannot handle non-empty timestamp argument SELECT Electorate FROM table WHERE Election date = 16 Cannot handle non-empty timestamp argument!
91 / 4855 1
92 / 4855 1
93 / 4855 1
94 / 4855 1
95 / 4855 1
96 / 4855 How many integrated allied-related are there? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT * FROM table WHERE integrated = integrated allied-related SELECT Integrated FROM table WHERE Allied-Related = Many
97 / 4855 1
98 / 4855 what is the integrated in which the holding allied-unrelated is many? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT integrated FROM table WHERE allied-unrelated = many SELECT Holding FROM table WHERE Allied-Unrelated = Many
99 / 4855 1
100 / 4855 1
101 / 4855 1
102 / 4855 1
103 / 4855 1
104 / 4855 1
105 / 4855 1
106 / 4855 Crockett High School had which number(#)? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT * FROM table WHERE high school = Crockett High School AND # = number SELECT # FROM table WHERE High School = Crockett
107 / 4855 Which home town was the high school Catholic University located in? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT home town FROM table WHERE high school = Catholic SELECT Home Town FROM table WHERE High School = Catholic University
108 / 4855 What height was the forward position at Crockett High School? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT height FROM table WHERE position = forward AND high school = Crockett High School SELECT Height FROM table WHERE Position = Forward AND High School = Crockett
109 / 4855 1
110 / 4855 1
111 / 4855 1
112 / 4855 1
113 / 4855 1
114 / 4855 1
115 / 4855 1
116 / 4855 1
117 / 4855 1
118 / 4855 1
119 / 4855 1
120 / 4855 1
121 / 4855 What is the score for the interview for the state of New York? ['State', 'Preliminaries', 'Interview', 'Swimsuit', 'Evening Gown', 'Average'] SELECT * FROM table WHERE interview = score AND state = New York SELECT Interview FROM table WHERE State = New York
122 / 4855 1
123 / 4855 1
124 / 4855 1
125 / 4855 1
126 / 4855 1
127 / 4855 1
128 / 4855 1
129 / 4855 1
130 / 4855 What is the theme for the episode selection process? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT theme FROM table WHERE episode = selection SELECT Theme FROM table WHERE Episode = Selection Process
131 / 4855 What is the song choice when the theme is not aired? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT song choice FROM table WHERE theme = not aired SELECT Theme FROM table WHERE Song choice = Not Aired
132 / 4855 What years did Markose Bristow Madhumita Bisht win the mens singles and/or the mixed doubles? ['Season', 'Mens singles', 'Womens singles', 'Mens doubles', 'Womens doubles', 'Mixed doubles'] SELECT * FROM table WHERE mens singles = Markose Bristow Madhumita Bisht SELECT Mens singles FROM table WHERE Mixed doubles = Markose Bristow Madhumita Bisht
133 / 4855 What year is Japan the country? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Japan SELECT Year FROM table WHERE Country = Japan
134 / 4855 What is the year that Dewi Claire Schreefel is the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Dewi Claire Schreefel SELECT Year FROM table WHERE Champion = Dewi Claire Schreefel
135 / 4855 What is the tournament location when Vicky Hurst in the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT tournament location FROM table WHERE tournament location = Vicky Hurst SELECT Tournament location FROM table WHERE Champion = Vicky Hurst
136 / 4855 1
137 / 4855 1
138 / 4855 1
139 / 4855 1
140 / 4855 Which is the charity that the background of the celebrity is heavyweight champion? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT charity FROM table WHERE celebrity = heavyweight champion SELECT Charity FROM table WHERE Background = Heavyweight Champion
141 / 4855 1
142 / 4855 1
143 / 4855 1
144 / 4855 What is the background of the celebrity who had the result 13 the celebrity apprentice (2008-03-27)? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT background FROM table WHERE celebrity = celebrity apprentice (2008-03-27) SELECT Background FROM table WHERE Result = 13 The Celebrity Apprentice (2008-03-27)
145 / 4855 1
146 / 4855 1
147 / 4855 1
148 / 4855 1
149 / 4855 1
150 / 4855 1
151 / 4855 1
152 / 4855 1
153 / 4855 1
154 / 4855 1
155 / 4855 What is the 2007 estimate when the rank (csa) is 4 ['Rank (CSA)', 'Combined Statistical Area (or Metropolitan Statistical Area if noted)', 'State(s)', '2007 Estimate', '2000 Population', 'Percent Change (1990–2000)'] SELECT * FROM table WHERE 2007 estimate = 2007 AND rank (csa) = 4 SELECT 2007 Estimate FROM table WHERE Rank (CSA) = 4
156 / 4855 1
157 / 4855 1
158 / 4855 1
159 / 4855 1
160 / 4855 1
161 / 4855 1
162 / 4855 1
163 / 4855 1
164 / 4855 1
165 / 4855 1
166 / 4855 What was the lost with tries for? ['Club', 'Played', 'Won', 'Drawn', 'Lost', 'Points for', 'Points against', 'Tries for', 'Tries against', 'Try bonus', 'Losing bonus', 'Points'] SELECT lost FROM table SELECT Lost FROM table WHERE Tries for = Tries for
167 / 4855 1
168 / 4855 1
169 / 4855 1
170 / 4855 1
171 / 4855 1
172 / 4855 What is the type of the printer ports included in the EX Plus3 model number? ['Model number', 'Printer ports', 'Network ports', 'Network protocols', 'Firmware', 'Notes'] SELECT * FROM table WHERE printer ports = ports AND model number = EX Plus3 SELECT Printer ports FROM table WHERE Model number = EX Plus3
173 / 4855 What is the traditional way to write the name of the district who's area is 2331? ['English Name', 'Simplified', 'Traditional', 'Pinyin', 'Area', 'Population', 'Density'] SELECT * FROM table WHERE area = 2331 SELECT Traditional FROM table WHERE Area = 2331
174 / 4855 1
175 / 4855 1
176 / 4855 1
177 / 4855 1
178 / 4855 1
179 / 4855 1
180 / 4855 What was the air date of part 2 of the episode whose part 1 was aired on January 31, 2008? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 2 FROM table WHERE part 2 = air date AND part 1 = January 31, 2008 SELECT Part 2 FROM table WHERE Part 1 = January 31, 2008
181 / 4855 What's the air date of part 1 of the episode whose part 2 aired on December 2, 2007? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 1 FROM table WHERE part 1 = air date AND part 2 = December 2, 2007 SELECT Part 1 FROM table WHERE Part 2 = December 2, 2007
182 / 4855 1
183 / 4855 1
184 / 4855 who is the the office with incumbent being ramon r. jimenez, jr. ['Department', 'Acronym', 'Office', 'Incumbent', 'in Office since'] SELECT office FROM table WHERE office = ramon r. jimenez, jr. SELECT Office FROM table WHERE Incumbent = Ramon R. Jimenez, Jr.
185 / 4855 1
186 / 4855 1
187 / 4855 1
188 / 4855 1
189 / 4855 1
190 / 4855 1
191 / 4855 1
192 / 4855 Who were the candidates when gregory w. meeks was the incumbent ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT candidates FROM table WHERE candidates = gregory w. meeks SELECT Candidates FROM table WHERE Incumbent = Gregory W. Meeks
193 / 4855 1
194 / 4855 1
195 / 4855 1
196 / 4855 1
197 / 4855 In which district is the incumbent Marcia C. Kaptur?  ['District', 'Incumbent', 'Party', 'First elected', 'Results', 'Candidates'] SELECT district FROM table WHERE district = Marcia C. Kaptur SELECT District FROM table WHERE Incumbent = Marcia C. Kaptur
198 / 4855 1
199 / 4855 1
200 / 4855 1
201 / 4855 1
202 / 4855 what's the first elected with opponent being ralph regula (r) 75.0% j. michael finn (d) 25.0% ['District', 'Incumbent', 'Party', 'First elected', 'Status', 'Opponent'] SELECT first elected FROM table WHERE first elected = ralph regula (r) 75.0% j. michael finn (d) 25.0% SELECT First elected FROM table WHERE Opponent = Ralph Regula (R) 75.0% J. Michael Finn (D) 25.0%
203 / 4855 1
204 / 4855 1
205 / 4855 1
206 / 4855 what's party with result being retired to run for u. s. senate republican hold ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT party FROM table WHERE party = retired to run for u. s. senate republican hold SELECT Party FROM table WHERE Result = Retired to run for U. S. Senate Republican hold
207 / 4855 1
208 / 4855 what's district with candidates being lawrence j. smith (d) 69.4% joseph smith (r) 30.6% ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = lawrence j. smith (d) 69.4% joseph smith (r) 30.6% SELECT District FROM table WHERE Candidates = Lawrence J. Smith (D) 69.4% Joseph Smith (R) 30.6%
209 / 4855 1
210 / 4855 1
211 / 4855 1
212 / 4855 1
213 / 4855 1
214 / 4855 1
215 / 4855 who are the candidates where the incumbent is sam m. gibbons? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT candidates FROM table WHERE candidates = sam m. gibbons SELECT Candidates FROM table WHERE Incumbent = Sam M. Gibbons
216 / 4855 what was the result where the candidates are sam m. gibbons (d) unopposed? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT result FROM table WHERE result = sam m. gibbons (d) unopposed SELECT Result FROM table WHERE Candidates = Sam M. Gibbons (D) Unopposed
217 / 4855 1
218 / 4855 What district is F. Edward Hebert the incumbent in? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = F. Edward Hebert SELECT District FROM table WHERE Incumbent = F. Edward Hebert
219 / 4855 1
220 / 4855 What's the district that Otto Passman is the incumbent of? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Otto Passman SELECT District FROM table WHERE Incumbent = Otto Passman
221 / 4855 What party is incumbent thomas j. lane from? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT party FROM table WHERE party = thomas j. lane SELECT Party FROM table WHERE Incumbent = Thomas J. Lane
222 / 4855 1
223 / 4855 1
224 / 4855 what's the district with incumbent being lawrence h. fountain ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = lawrence h. fountain SELECT District FROM table WHERE Incumbent = Lawrence H. Fountain
225 / 4855 1
226 / 4855 1
227 / 4855 What was the result of the election of the incumbent harry r. sheppard? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT result FROM table WHERE result = harry r. sheppard SELECT Result FROM table WHERE Incumbent = Harry R. Sheppard
228 / 4855 What district did incumbent Ralph A. Gamble represent? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Ralph A. Gamble SELECT District FROM table WHERE Incumbent = Ralph A. Gamble
229 / 4855 1
230 / 4855 1
231 / 4855 What district does  incumbent  james c. davis represent? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = james c. davis SELECT District FROM table WHERE Incumbent = James C. Davis
232 / 4855 1
233 / 4855 1
234 / 4855 What district was Harold Earthman the incumbent in?  ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Harold Earthman SELECT District FROM table WHERE Incumbent = Harold Earthman
235 / 4855 Who were the candidates when Noble Jones Gregory was incumbent? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT candidates FROM table WHERE candidates = Noble Jones Gregory SELECT Candidates FROM table WHERE Incumbent = Noble Jones Gregory
236 / 4855 1
237 / 4855 1
238 / 4855 1
239 / 4855 1
240 / 4855 1
241 / 4855 1
242 / 4855 What was the winning party when the incumbent was richard s. whaley? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT party FROM table WHERE party = richard s. whaley SELECT Party FROM table WHERE Incumbent = Richard S. Whaley
243 / 4855 1
244 / 4855 1
245 / 4855 1
246 / 4855 1
247 / 4855 1
248 / 4855 Pink cytoplasm is seen in a test that specifically stains what? ['Stain', 'Common use', 'Nucleus', 'Cytoplasm', 'Red blood cell (RBC)', 'Collagen fibers', 'Specifically stains'] SELECT * FROM table WHERE cytoplasm = Pink cytoplasm SELECT Specifically stains FROM table WHERE Cytoplasm = Pink

Our accuracy statistics for this case is as follows.


*   Select accuracy: 95.43%
*   Where accuracy: 82.35%
*   Value accuracy: 90.26%
*   Overall accuracy 78.41%

# Case 4: No Aggregation, Attributes Explicitly Present in NLQ, Only One WHERE and SELECT Attribute

We evaluate accuracy assuming that

*   the SELECT and WHERE attributes are explicitly present in the NLQ
*   there are no aggregate functions like MAX, MIN, COUNT, or others
*   nlq2sql uses rule 1 (defined in our report)
*   only one SELECT and WHERE attribute exist

We also assume that there are no WHERE clauses with any operator other than '=' but no such queries exist when we also impose the condition that attributes need to be explicitly present in the NLQ.

The ner model we used in the evaluation below doesn't support aggregation.

In [30]:
filters = {'is_select_not_present_in_nlq',
           'is_invalid_constraint',
           'is_invalid_num_select_attr',
           'is_invalid_num_where_attr',
           'attr_not_present_in_nlq',
           'is_aggregate'}
tagTestSet = filter_test_data(filters)
print(len(tagTestSet))

100%|██████████| 15878/15878 [00:06<00:00, 2435.85it/s]

3932
3932

In [31]:
evaluate_data(tagTestSet, nlp_ner, 'rule1')

0 / 3932 1
1 / 3932 1
2 / 3932 1
3 / 3932 1
4 / 3932 1
5 / 3932 1
6 / 3932 1
7 / 3932 1
8 / 3932 1
9 / 3932 1
10 / 3932 1
11 / 3932 1
12 / 3932 1
13 / 3932 1
14 / 3932 1
15 / 3932 1
16 / 3932 what's the original air date with title  "hell" ['No. in series', 'No. in season', 'Title', 'Directed by', 'Written by', 'Original air date'] SELECT original air date FROM table WHERE title = "hell" SELECT Original air date FROM table WHERE Title = Hell
17 / 3932 1
18 / 3932 What is the percentage of the  trance- n himalaya zone that corresponds with the high hill zone is 25%? ['Particulars and Characteristics', 'Shivalik Zone', 'Mid-Hill Zone', 'High hill zone', 'Trance- n Himalaya Zone'] SELECT * FROM table WHERE high hill zone = 25% SELECT Trance- n Himalaya Zone FROM table WHERE High hill zone = 25%
19 / 3932 1
20 / 3932 1
21 / 3932 1
22 / 3932 1
23 / 3932 Which song has picturization by only vijay? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT song FROM table WHERE picturization = only vijay SELECT Song FROM table WHERE Picturization = Vijay
24 / 3932 For which singers was Alangudi Somu the lyricist? ['Track #', 'Song', 'Singers', 'Picturization', 'Length', 'Lyricist'] SELECT * FROM table WHERE singers = Alangudi Somu SELECT Singers FROM table WHERE Lyricist = Alangudi Somu
25 / 3932 1
26 / 3932 1
27 / 3932 What percentage of The Bronx voters occured when Manhattan had 29.9% of voters? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT The Bronx FROM table WHERE % = 29.9% SELECT The Bronx FROM table WHERE Manhattan = 29.9%
28 / 3932 What number of voters did the Bronx have when the total number was 2054? ['1953', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE the bronx = voters AND total = 2054 SELECT The Bronx FROM table WHERE Total = 2054
29 / 3932 1
30 / 3932 1
31 / 3932 1
32 / 3932 Which candidate won 88 votes in Queens in 1921? ['1921', 'party', 'Manhattan', 'The Bronx', 'Brooklyn', 'Queens', 'Richmond [Staten Is.]', 'Total', '%'] SELECT * FROM table WHERE queens = 88 SELECT 1921 FROM table WHERE Queens = 88
33 / 3932 1
34 / 3932 1
35 / 3932 1
36 / 3932 What are the highest recorded attendance rates of the stadiums with an average attendance of 4752? ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average'] SELECT * FROM table WHERE average = 4752 SELECT Highest FROM table WHERE Average = 4752
37 / 3932 What is the catalog number of the title called "super callanetics"? ['Year', 'Title', 'Format', 'Studio', 'Release Date', 'Copyright Information', 'Catalog Number'] SELECT * FROM table WHERE title = "super callanetics" SELECT Catalog Number FROM table WHERE Title = Super Callanetics
38 / 3932 1
39 / 3932 1
40 / 3932 1
41 / 3932 1
42 / 3932 What is the premiere on the mega channel? ['Country/Region', 'Show Title', 'Languages', 'Host', 'Channel', 'Premiere', 'Seasons', 'Status'] SELECT premiere FROM table WHERE channel = mega SELECT Premiere FROM table WHERE Channel = Mega Channel
43 / 3932 1
44 / 3932 1
45 / 3932 1
46 / 3932 1
47 / 3932 1
48 / 3932 1
49 / 3932 1
50 / 3932 1
51 / 3932 1
52 / 3932 1
53 / 3932 1
54 / 3932 1
55 / 3932 1
56 / 3932 1
57 / 3932 If the model is  15.180e, what is the GVM (kg) Technical Capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE model = Technical Capacity SELECT GVM (kg) Technical Capacity FROM table WHERE Model = 15.180E
58 / 3932 When the transmission make/type/speed is eaton fs 5306-a manual synchromesh 6 speed, what is the value of the gcm (kg) technical capacity? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT * FROM table WHERE transmission make/type/speed = technical capacity SELECT GCM (kg) Technical Capacity FROM table WHERE Transmission Make/Type/Speed = Eaton FS 5306-A Manual Synchromesh 6 Speed
59 / 3932 Which model possesses a transmission make/type/speed of eaton fs-6306 a manual synchromesh 6 speed? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT model FROM table WHERE transmission make/type/speed = manual synchromesh 6 SELECT Model FROM table WHERE Transmission Make/Type/Speed = Eaton FS-6306 A Manual Synchromesh 6 Speed
60 / 3932 For driver Mark Skaife what is the result for race 1? ['Driver', 'No.', 'Team', 'Car', 'Race 1', 'GP 100', 'Race 3', 'Points'] SELECT * FROM table WHERE driver = 1 AND race 1 = result SELECT Race 1 FROM table WHERE Driver = Mark Skaife
61 / 3932 1
62 / 3932 1
63 / 3932 1
64 / 3932 1
65 / 3932 1
66 / 3932 1
67 / 3932 1
68 / 3932 1
69 / 3932 1
70 / 3932 1
71 / 3932 1
72 / 3932 1
73 / 3932 1
74 / 3932 1
75 / 3932 1
76 / 3932 1
77 / 3932  what's the introduced where notes is 9 withdrawn in 1946 after fire ['Number Range', 'Introduced', 'Builder', 'Engine', 'Weight (long tons)', 'Seats', 'Withdrawn', 'Notes'] SELECT introduced FROM table WHERE withdrawn = 9 withdrawn in 1946 after fire SELECT Introduced FROM table WHERE Notes = 9 withdrawn in 1946 after fire
78 / 3932 1
79 / 3932 1
80 / 3932 1
81 / 3932 what is the song name for the film name ganga kare insaaf? ['Year', 'Song name', 'Film name', 'Co-singer', 'Music director', 'Lyricist', 'Language'] SELECT * FROM table WHERE film name = ganga kare insaaf SELECT Song name FROM table WHERE Film name = Ganga Kare Insaaf
82 / 3932 1
83 / 3932  what's the electorate where election date is 16 cannot handle non-empty timestamp argument! ['Member', 'Electorate', 'Province', 'MPs term', 'Election date'] SELECT electorate FROM table WHERE election date = 16 cannot handle non-empty timestamp argument SELECT Electorate FROM table WHERE Election date = 16 Cannot handle non-empty timestamp argument!
84 / 3932 1
85 / 3932 1
86 / 3932 1
87 / 3932 1
88 / 3932 1
89 / 3932 How many integrated allied-related are there? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT * FROM table WHERE integrated = integrated allied-related SELECT Integrated FROM table WHERE Allied-Related = Many
90 / 3932 1
91 / 3932 what is the integrated in which the holding allied-unrelated is many? ['Component', 'Integrated', 'Allied-Related', 'Allied-Unrelated', 'Holding'] SELECT integrated FROM table WHERE allied-unrelated = many SELECT Holding FROM table WHERE Allied-Unrelated = Many
92 / 3932 1
93 / 3932 1
94 / 3932 1
95 / 3932 1
96 / 3932 1
97 / 3932 1
98 / 3932 Crockett High School had which number(#)? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT * FROM table WHERE high school = Crockett High School AND # = number SELECT # FROM table WHERE High School = Crockett
99 / 3932 Which home town was the high school Catholic University located in? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT home town FROM table WHERE high school = Catholic SELECT Home Town FROM table WHERE High School = Catholic University
100 / 3932 1
101 / 3932 1
102 / 3932 1
103 / 3932 1
104 / 3932 1
105 / 3932 1
106 / 3932 1
107 / 3932 1
108 / 3932 1
109 / 3932 1
110 / 3932 1
111 / 3932 1
112 / 3932 What is the score for the interview for the state of New York? ['State', 'Preliminaries', 'Interview', 'Swimsuit', 'Evening Gown', 'Average'] SELECT * FROM table WHERE interview = score AND state = New York SELECT Interview FROM table WHERE State = New York
113 / 3932 1
114 / 3932 1
115 / 3932 1
116 / 3932 1
117 / 3932 1
118 / 3932 1
119 / 3932 1
120 / 3932 1
121 / 3932 What is the theme for the episode selection process? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT theme FROM table WHERE episode = selection SELECT Theme FROM table WHERE Episode = Selection Process
122 / 3932 What is the song choice when the theme is not aired? ['Episode', 'Theme', 'Song choice', 'Original artist', 'Order #', 'Result'] SELECT song choice FROM table WHERE theme = not aired SELECT Theme FROM table WHERE Song choice = Not Aired
123 / 3932 What years did Markose Bristow Madhumita Bisht win the mens singles and/or the mixed doubles? ['Season', 'Mens singles', 'Womens singles', 'Mens doubles', 'Womens doubles', 'Mixed doubles'] SELECT * FROM table WHERE mens singles = Markose Bristow Madhumita Bisht SELECT Mens singles FROM table WHERE Mixed doubles = Markose Bristow Madhumita Bisht
124 / 3932 What year is Japan the country? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Japan SELECT Year FROM table WHERE Country = Japan
125 / 3932 What is the year that Dewi Claire Schreefel is the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT year FROM table WHERE year = Dewi Claire Schreefel SELECT Year FROM table WHERE Champion = Dewi Claire Schreefel
126 / 3932 What is the tournament location when Vicky Hurst in the champion? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT tournament location FROM table WHERE tournament location = Vicky Hurst SELECT Tournament location FROM table WHERE Champion = Vicky Hurst
127 / 3932 1
128 / 3932 1
129 / 3932 1
130 / 3932 1
131 / 3932 Which is the charity that the background of the celebrity is heavyweight champion? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT charity FROM table WHERE celebrity = heavyweight champion SELECT Charity FROM table WHERE Background = Heavyweight Champion
132 / 3932 1
133 / 3932 1
134 / 3932 1
135 / 3932 What is the background of the celebrity who had the result 13 the celebrity apprentice (2008-03-27)? ['Celebrity', 'Background', 'Original Team', 'Age', 'Hometown', 'Charity', 'Result', 'Raised'] SELECT background FROM table WHERE celebrity = celebrity apprentice (2008-03-27) SELECT Background FROM table WHERE Result = 13 The Celebrity Apprentice (2008-03-27)
136 / 3932 1
137 / 3932 1
138 / 3932 1
139 / 3932 1
140 / 3932 1
141 / 3932 1
142 / 3932 1
143 / 3932 1
144 / 3932 What is the 2007 estimate when the rank (csa) is 4 ['Rank (CSA)', 'Combined Statistical Area (or Metropolitan Statistical Area if noted)', 'State(s)', '2007 Estimate', '2000 Population', 'Percent Change (1990–2000)'] SELECT * FROM table WHERE rank (csa) = 4 SELECT 2007 Estimate FROM table WHERE Rank (CSA) = 4
145 / 3932 1
146 / 3932 1
147 / 3932 1
148 / 3932 1
149 / 3932 1
150 / 3932 1
151 / 3932 1
152 / 3932 1
153 / 3932 1
154 / 3932 What was the lost with tries for? ['Club', 'Played', 'Won', 'Drawn', 'Lost', 'Points for', 'Points against', 'Tries for', 'Tries against', 'Try bonus', 'Losing bonus', 'Points'] SELECT lost FROM table SELECT Lost FROM table WHERE Tries for = Tries for
155 / 3932 1
156 / 3932 1
157 / 3932 1
158 / 3932 1
159 / 3932 What is the type of the printer ports included in the EX Plus3 model number? ['Model number', 'Printer ports', 'Network ports', 'Network protocols', 'Firmware', 'Notes'] SELECT * FROM table WHERE printer ports = type AND model number = EX Plus3 SELECT Printer ports FROM table WHERE Model number = EX Plus3
160 / 3932 What is the traditional way to write the name of the district who's area is 2331? ['English Name', 'Simplified', 'Traditional', 'Pinyin', 'Area', 'Population', 'Density'] SELECT * FROM table WHERE area = 2331 SELECT Traditional FROM table WHERE Area = 2331
161 / 3932 1
162 / 3932 1
163 / 3932 1
164 / 3932 1
165 / 3932 1
166 / 3932 What was the air date of part 2 of the episode whose part 1 was aired on January 31, 2008? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 2 FROM table WHERE part 2 = air date AND part 1 = January 31, 2008 SELECT Part 2 FROM table WHERE Part 1 = January 31, 2008
167 / 3932 What's the air date of part 1 of the episode whose part 2 aired on December 2, 2007? ['Episode #', 'Title', 'Part 1', 'Part 2', 'Part 3', 'Part 4', 'Part 5', 'Part 6'] SELECT part 1 FROM table WHERE part 1 = air date AND part 2 = December 2, 2007 SELECT Part 1 FROM table WHERE Part 2 = December 2, 2007
168 / 3932 1
169 / 3932 1
170 / 3932 1
171 / 3932 1
172 / 3932 1
173 / 3932 1
174 / 3932 1
175 / 3932 1
176 / 3932 1
177 / 3932 1
178 / 3932 Who were the candidates when gregory w. meeks was the incumbent ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT candidates FROM table WHERE candidates = gregory w. meeks SELECT Candidates FROM table WHERE Incumbent = Gregory W. Meeks
179 / 3932 1
180 / 3932 1
181 / 3932 1
182 / 3932 1
183 / 3932 1
184 / 3932 1
185 / 3932 1
186 / 3932 1
187 / 3932 1
188 / 3932 1
189 / 3932 1
190 / 3932 1
191 / 3932 1
192 / 3932 1
193 / 3932 1
194 / 3932 1
195 / 3932 1
196 / 3932 1
197 / 3932 1
198 / 3932 1
199 / 3932 1
200 / 3932 1
201 / 3932 1
202 / 3932 1
203 / 3932 What district is F. Edward Hebert the incumbent in? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = F. Edward Hebert SELECT District FROM table WHERE Incumbent = F. Edward Hebert
204 / 3932 1
205 / 3932 What's the district that Otto Passman is the incumbent of? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Otto Passman SELECT District FROM table WHERE Incumbent = Otto Passman
206 / 3932 1
207 / 3932 1
208 / 3932 1
209 / 3932 1
210 / 3932 1
211 / 3932 1
212 / 3932 1
213 / 3932 1
214 / 3932 1
215 / 3932 1
216 / 3932 1
217 / 3932 1
218 / 3932 1
219 / 3932 What district was Harold Earthman the incumbent in?  ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT district FROM table WHERE district = Harold Earthman SELECT District FROM table WHERE Incumbent = Harold Earthman
220 / 3932 1
221 / 3932 1
222 / 3932 1
223 / 3932 1
224 / 3932 1
225 / 3932 1
226 / 3932 1
227 / 3932 1
228 / 3932 1
229 / 3932 1
230 / 3932 1
231 / 3932 1
232 / 3932 1
233 / 3932 Pink cytoplasm is seen in a test that specifically stains what? ['Stain', 'Common use', 'Nucleus', 'Cytoplasm', 'Red blood cell (RBC)', 'Collagen fibers', 'Specifically stains'] SELECT * FROM table WHERE cytoplasm = Pink cytoplasm SELECT Specifically stains FROM table WHERE Cytoplasm = Pink
234 / 3932 The pink cytoplasm will have a nucleus of what color? ['Stain', 'Common use', 'Nucleus', 'Cytoplasm', 'Red blood cell (RBC)', 'Collagen fibers', 'Specifically stains'] SELECT nucleus FROM table WHERE cytoplasm = pink cytoplasm SELECT Nucleus FROM table WHERE Cytoplasm = Pink
235 / 3932 where is hte second place winner from united kingdom? ['Year', 'Winner', 'Language', 'Artist', 'Song', 'Points', 'Margin', 'Second place', 'Date', 'Venue', 'Location', 'Participants'] SELECT second place FROM table WHERE winner = united kingdom SELECT Winner FROM table WHERE Second place = United Kingdom
236 / 3932 1
237 / 3932 1
238 / 3932 1
239 / 3932 1
240 / 3932 1
241 / 3932 1
242 / 3932 1
243 / 3932 1
244 / 3932 1
245 / 3932 1
246 / 3932 what's the byu-uu score with uu-usu score being 44–16 ['Season', 'Winner', 'BYU-UU score', 'BYU-USU score', 'UU-USU score'] SELECT * FROM table WHERE uu-usu score = 44–16 SELECT BYU-UU score FROM table WHERE UU-USU score = 44–16
247 / 3932 1
248 / 3932 1
249 / 3932 1
250 / 3932 1
251 / 3932 1
252 / 3932 1
253 / 3932 1
254 / 3932 1
255 / 3932 1
256 / 3932 1
257 / 3932 1
258 / 3932 1
259 / 3932 1
260 / 3932 1
261 / 3932 what's the result with opponent being at oakland raiders ['Week', 'Date', 'Opponent', 'Result', 'Stadium', 'Record', 'Attendance'] SELECT result FROM table WHERE opponent = oakland raiders SELECT Result FROM table WHERE Opponent = at Oakland Raiders
262 / 3932 1
263 / 3932 1
264 / 3932 The results for gt2 winning team is all lars-erik nielsen allan simonsen richard westbrook.  ['Rnd', 'Circuit', 'LMP1 Winning Team', 'LMP2 Winning Team', 'GT1 Winning Team', 'GT2 Winning Team', 'Results'] SELECT results FROM table WHERE gt2 winning team = all lars-erik nielsen allan simonsen richard westbrook SELECT Results FROM table WHERE GT2 Winning Team = Lars-Erik Nielsen Allan Simonsen Richard Westbrook
265 / 3932 1
266 / 3932 1
267 / 3932 1
268 / 3932 1
269 / 3932 1
270 / 3932 1
271 / 3932 1
272 / 3932 1
273 / 3932 1
274 / 3932 1
275 / 3932 1
276 / 3932 1
277 / 3932 picturesque and trekking route is the category what is the height from sea level in meters? ['Name Of Place', 'Height from Sea Level In Meters', 'Nearby Town', 'Trekking Route', 'Category'] SELECT height from sea level in meters FROM table WHERE trekking route = picturesque and trekking route SELECT Height from Sea Level In Meters FROM table WHERE Category = Picturesque and Trekking Route
278 / 3932 1
279 / 3932 1
280 / 3932 1
281 / 3932 1
282 / 3932 When the total points are 22 how many total touchdowns have been made? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table WHERE points = 22 AND touchdowns = total touchdowns SELECT Touchdowns FROM table WHERE Points = 22
283 / 3932 1
284 / 3932 Who led the points classification when Roman Kreuziger led the young rider classification? ['Stage', 'Winner', 'General classification', 'Points classification', 'Mountains classification', 'Young rider classification', 'Team classification', 'Combativity award'] SELECT points classification FROM table WHERE points classification = Roman Kreuziger SELECT Points classification FROM table WHERE Young rider classification = Roman Kreuziger
285 / 3932 Name the hometown for ventrell jenkins ['Position', 'Number', 'Name', 'Height', 'Weight', 'Class', 'Hometown', 'Games↑'] SELECT hometown FROM table WHERE hometown = ventrell jenkins SELECT Hometown FROM table WHERE Name = Ventrell Jenkins
286 / 3932 1
287 / 3932 1
288 / 3932 1
289 / 3932 1
290 / 3932 What locale has the skip Colleen Jones? ['Locale', 'Skip', 'W', 'L', 'PF', 'PA', 'Ends Won', 'Ends Lost', 'Blank Ends', 'Stolen Ends', 'Shot Pct.'] SELECT locale FROM table WHERE l = Colleen Jones SELECT Locale FROM table WHERE Skip = Colleen Jones
291 / 3932 Who plays Overton Moyle in casino theatre 1888 & savoy theatre 1906? ['Role', 'Savoy Theatre 1888', 'Casino Theatre 1888', 'Savoy Theatre 1897', 'Savoy Theatre 1906', 'Savoy Theatre 1909'] SELECT * FROM table WHERE casino theatre 1888 = Overton Moyle AND savoy theatre 1906 = casino theatre 1888 & savoy theatre 1906 SELECT Casino Theatre 1888 FROM table WHERE Savoy Theatre 1906 = Overton Moyle
292 / 3932 1
293 / 3932 1
294 / 3932 what's the result with opponent being at new england patriots ['Week', 'Date', 'Opponent', 'Result', 'Record', 'Game Site', 'Attendance'] SELECT result FROM table WHERE opponent = new england patriots SELECT Result FROM table WHERE Opponent = at New England Patriots
295 / 3932 1
296 / 3932 1
297 / 3932 1
298 / 3932 1
299 / 3932 1
300 / 3932 1
301 / 3932 1
302 / 3932 What is the result at the Masters for the player who finished R16 at the PGA Ch.? ['Nationality', 'Player', 'Year', 'Wins', 'Masters', 'U.S. Open', 'Open Ch.', 'PGA Ch.'] SELECT * FROM table WHERE pga ch. = R16 SELECT Masters FROM table WHERE PGA Ch. = R16
303 / 3932 1
304 / 3932 1
305 / 3932 1
306 / 3932 1
307 / 3932 1
308 / 3932 which electorate is 54787 of the constituency ['Constituency', 'Electorate', 's Spoilt vote', 'Total poll (%)', 'For (%)', 'Against (%)'] SELECT electorate FROM table WHERE electorate = 54787 SELECT Constituency FROM table WHERE Electorate = 54787
309 / 3932 1
310 / 3932 1
311 / 3932 1

Our accuracy statistics for this case is as follows.

*   Select accuracy: 95.37%
*   Where accuracy: 88.73%
*   Value accuracy: 93.54%
*   Overall accuracy 83.62%

#Case 5: Only Aggregate Function Queries, Attributes Explicitly Present in NLQ, Rule 3
We evaluate accuracy assuming that

*   the SELECT and WHERE attributes are explicitly present in the NLQ
*   there are ONLY aggregate functions like MAX, MIN, COUNT, or others.
*   nlq2sql uses rule 3 (defined in our report)

We also assume that there are no WHERE clauses with any operator other than '=' but no such queries exist when we also impose the condition that attributes need to be explicitly present in the NLQ.

The ner model we used in the evaluation below supports aggregation.

In [44]:
tagTestSet = obtain_aggregate_queries()
print(len(tagTestSet))

100%|██████████| 15878/15878 [00:04<00:00, 3592.94it/s]

2027
2027

In [48]:
evaluate_data(tagTestSet, nlp_aggr, 'rule3')

0 / 2027 what is the total number of total w–l where doubles w–l is 11–11 ['Player', 'Total W–L', 'Singles W–L', 'Doubles W–L', 'Ties played', 'Debut', 'Years played'] SELECT * FROM table WHERE doubles w–l = 11–11 SELECT COUNT Total W–L FROM table WHERE Doubles W–L = 11–11
1 / 2027 what is the total number of singles w–l where doubles w–l is 11–14 ['Player', 'Total W–L', 'Singles W–L', 'Doubles W–L', 'Ties played', 'Debut', 'Years played'] SELECT * FROM table WHERE doubles w–l = 11–14 SELECT COUNT Singles W–L FROM table WHERE Doubles W–L = 11–14
2 / 2027 1
3 / 2027 1
4 / 2027 What is the Frequency at the Market/Rank of Burlington - Plattsburgh , Vermont - New York /143? ['Calls', 'Frequency', 'Branding', 'Format', 'Market/Rank', 'Timeslot', 'Group owner'] SELECT Frequency FROM table WHERE market/rank = Burlington - Plattsburgh , Vermont - New York /143 SELECT COUNT Frequency FROM table WHERE Market/Rank = Burlington - Plattsburgh , Vermont - New York /143
5 / 2027 Of the years that had exactly 17096 departures, what is the greatest number of aircraft kilometers flown? ['Year', 'Aircraft kilometers', 'Departures', 'Flying hours', 'Passengers', 'Seat factor', 'Employees', 'Profit/loss'] SELECT * FROM table WHERE departures = 17096 AND aircraft kilometers = aircraft kilometers flown SELECT MAX Aircraft kilometers FROM table WHERE Departures = 17096
6 / 2027 what's the minimum total with crop (kilotonnes) being s lupin ['Crop (kilotonnes)', 'New South Wales', 'Victoria', 'Queensland', 'Western Australia', 'South Australia', 'Tasmania', 'Total'] SELECT * FROM table WHERE crop (kilotonnes) = s lupin SELECT MIN Total FROM table WHERE Crop (kilotonnes) = s Lupin
7 / 2027 1
8 / 2027 what's the minimum tasmania value ['Crop (kilotonnes)', 'New South Wales', 'Victoria', 'Queensland', 'Western Australia', 'South Australia', 'Tasmania', 'Total'] SELECT * FROM table SELECT MIN Tasmania FROM table
9 / 2027 what's the total number of tasmania with new south wales crop of 190 kilotonnes ['Crop (kilotonnes)', 'New South Wales', 'Victoria', 'Queensland', 'Western Australia', 'South Australia', 'Tasmania', 'Total'] SELECT COUNT tasmania FROM table WHERE new south wales = 190 kilotonnes SELECT COUNT Tasmania FROM table WHERE New South Wales = 190
10 / 2027 In what group stage were 177.2 points awarded? ['Rank', 'Member Association', 'Points', 'Group stage', 'Play-off', 'AFC Cup'] SELECT group stage FROM table WHERE points = 177.2 SELECT COUNT Group stage FROM table WHERE Points = 177.2
11 / 2027 If % mcconnell is 47.17% what is the total number of mcconnell ? ['County', 'Precincts', 'Lunsford', '% Lunsford', 'McConnell', '% McConnell', 'Total'] SELECT COUNT mcconnell FROM table WHERE mcconnell = 47.17% SELECT COUNT McConnell FROM table WHERE % McConnell = 47.17%
12 / 2027 1
13 / 2027 What's the standard of the country who won its first title in 1992? ['Country', 'Players', 'Standard', 'Minor', 'First title', 'Last title'] SELECT standard FROM table WHERE first title = 1992 SELECT MAX Standard FROM table WHERE First title = 1992
14 / 2027 What's the smallest number of players? ['Country', 'Players', 'Standard', 'Minor', 'First title', 'Last title'] SELECT * FROM table WHERE players = number of players SELECT MIN Players FROM table
15 / 2027 In what year was the last last title received, by any of the countries? ['Country', 'Players', 'Standard', 'Minor', 'First title', 'Last title'] SELECT * FROM table WHERE last title = last last title SELECT MAX Last title FROM table
16 / 2027 1
17 / 2027 What was the highest amount of people that attended the elgin city team? ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT MAX highest FROM table WHERE team = elgin city SELECT COUNT Highest FROM table WHERE Team = Elgin City
18 / 2027 The firs park stadium had the lowest average attendence of what? ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE stadium = firs park stadium AND average = average attendence SELECT MIN Average FROM table WHERE Stadium = Firs Park
19 / 2027 What was the lowest highest attendance for the dumbarton team? ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE highest = attendance AND team = dumbarton SELECT MIN Highest FROM table WHERE Team = Dumbarton
20 / 2027 The gayfield park stadium had a highest attendance of what? ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE stadium = gayfield park stadium AND highest = attendance SELECT MAX Highest FROM table WHERE Stadium = Gayfield Park
21 / 2027 The stenhousemuir team had how many highest attendances? ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE team = stenhousemuir SELECT COUNT Highest FROM table WHERE Team = Stenhousemuir
22 / 2027 what is the minimum rank ['Rank', 'English title', 'Chinese title', 'Average', 'Peak', 'Premiere', 'Finale', 'HK viewers'] SELECT * FROM table SELECT MIN Rank FROM table
23 / 2027 What is Pittodrie Stadium's maximum capacity? ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average'] SELECT MAX capacity FROM table WHERE stadium = Pittodrie Stadium SELECT MAX Capacity FROM table WHERE Stadium = Pittodrie
24 / 2027 What is the highest number of ties? ['Player', 'W-L (Total)', 'W-L ( Singles )', 'W-L ( Doubles )', 'Ties', 'Debut', 'Years Played'] SELECT MAX ties FROM table SELECT MAX Ties FROM table
25 / 2027 What was the # for the episode "the birthday present"? ['#', 'Episode', 'Air Date', 'Timeslot (EST)', 'Rating', 'Share', '18–49 Rating', 'Viewers (millions)', 'Rank'] SELECT MAX # FROM table WHERE episode = "the birthday present" SELECT MAX # FROM table WHERE Episode = The Birthday Present
26 / 2027 What was the # for the episode "the wedding"? ['#', 'Episode', 'Air Date', 'Timeslot (EST)', 'Rating', 'Share', '18–49 Rating', 'Viewers (millions)', 'Rank'] SELECT MAX # FROM table WHERE episode = "the wedding" SELECT MAX # FROM table WHERE Episode = The Wedding
27 / 2027 1
28 / 2027 1
29 / 2027 what is the total number of kickoff [a ] where week is week ['Week', 'Date', 'Opponent', 'Result', 'Kickoff [a ]', 'Game site', 'TV', 'Attendance', 'Record'] SELECT COUNT kickoff [a ] FROM table SELECT COUNT Kickoff [a ] FROM table WHERE Week = Week
30 / 2027 What is the power kw@RPM of the 13.180 model? ['Model', 'Engine make/Capacity', 'Power kW@rpm', 'Torque Nm@rpm', 'Transmission Make/Type/Speed', 'GVM (kg) Technical Capacity', 'GCM (kg) Technical Capacity'] SELECT power kw@RPM FROM table WHERE model = 13.180 SELECT COUNT Power kW@rpm FROM table WHERE Model = 13.180
31 / 2027 1
32 / 2027 What is the area (square km) where the arrondissement is millau? ['Dep.', 'Chief town', 'Arrondissement', 'Population (1999)', 'Area (Square km)', 'Pop density', 'Cantons', 'Communes'] SELECT area (square km) FROM table WHERE arrondissement = millau SELECT MIN Area (Square km) FROM table WHERE Arrondissement = Millau
33 / 2027 1
34 / 2027 How many communes when the arrondissement is cosne-cours-sur-loire? ['Dep.', 'Chief town', 'Arrondissement', 'Population (1999)', 'Area (Square km)', 'Pop density', 'Cantons', 'Communes'] SELECT communes FROM table WHERE arrondissement = cosne-cours-sur-loire SELECT MIN Communes FROM table WHERE Arrondissement = Cosne-Cours-sur-Loire
35 / 2027 1
36 / 2027 1
37 / 2027 What number (#) is associated with the Name Ron Baxter? ['Name', '#', 'Position', 'Height', 'Weight', 'Year', 'Home Town', 'High School'] SELECT * FROM table WHERE name = Ron Baxter SELECT COUNT # FROM table WHERE Name = Ron Baxter
38 / 2027 what is the minimum voted no where percent no is 56.6 ['Jurisdiction', 'Voted Yes', 'Percent Yes', 'Voted No', 'Percent No'] SELECT * FROM table WHERE percent no = 56.6 SELECT MIN Voted No FROM table WHERE Percent No = 56.6
39 / 2027 what is the minimum voted yes where percent no is 68.2 ['Jurisdiction', 'Voted Yes', 'Percent Yes', 'Voted No', 'Percent No'] SELECT * FROM table WHERE percent no = 68.2 SELECT MIN Voted Yes FROM table WHERE Percent No = 68.2
40 / 2027 1
41 / 2027 The earliest year is 1996. ['Year', 'Product', 'Production', 'Consumption', 'Import', 'Export'] SELECT * FROM table WHERE year = 1996 SELECT MIN Year FROM table
42 / 2027 1
43 / 2027 1
44 / 2027 1
45 / 2027 1
46 / 2027 What is the winners Share ($) in the year 2004? ['Year', 'Champion', 'Country', 'Score', 'Tournament location', 'Purse ($)', 'Winners share ($)'] SELECT * FROM table WHERE winners share ($) = winners Share ($) in AND year = 2004 SELECT MIN Winners share ($) FROM table WHERE Year = 2004
47 / 2027 What is the general classification with the winner being evgeni berzin? ['Stage', 'Winner', 'General classification', 'Points classification', 'Mountains classification', 'Intergiro classification', 'Trofeo Fast Team'] SELECT general classification FROM table WHERE winner = evgeni berzin SELECT COUNT General classification FROM table WHERE Winner = Evgeni Berzin
48 / 2027 How many season did sportfreunde siegen win best supported club? ['Season', 'Overall Spectators', 'Per game', 'Best supported Club', 'Spectators /game', 'Top goal scorer', 'Goals'] SELECT COUNT season FROM table WHERE season = sportfreunde siegen SELECT COUNT Season FROM table WHERE Best supported Club = Sportfreunde Siegen
49 / 2027 what is the minimum production code ['Season #', 'Series #', 'Title', 'Canadian airdate', 'U.S. airdate', 'Production code'] SELECT * FROM table SELECT MIN Production code FROM table
50 / 2027 When was the institution of Kansas city Kansas community college founded? ['Institution', 'Main Campus Location', 'Founded', 'Mascot', 'School Colors'] SELECT MAX founded FROM table WHERE founded = Kansas city Kansas community college SELECT COUNT Founded FROM table WHERE Institution = Kansas City Kansas Community College
51 / 2027 1
52 / 2027 1
53 / 2027 What is the number of the original airdate with the production code 208. ['Series Ep #', 'Season 2 Ep #', 'Title', 'Director', 'Writer(s)', 'Original Airdate', 'Production Code'] SELECT original airdate FROM table WHERE production code = 208 SELECT COUNT Original Airdate FROM table WHERE Production Code = 208
54 / 2027 What is the largest number of rounds for the team that hired Donnie Wingo as crew chief? ['Team', 'Car(s)', '#', 'Driver(s)', 'Primary Sponsor(s)', 'Owner(s)', 'Crew Chief', 'Rounds'] SELECT * FROM table WHERE crew chief = Donnie Wingo SELECT MAX Rounds FROM table WHERE Crew Chief = Donnie Wingo
55 / 2027 1
56 / 2027 How many tries for are for 473 points for? ['Club', 'Played', 'Won', 'Drawn', 'Lost', 'Points for', 'Points against', 'Tries for', 'Tries against', 'Try bonus', 'Losing bonus', 'Points'] SELECT tries for FROM table WHERE points = 473 SELECT COUNT Tries for FROM table WHERE Points for = 473
57 / 2027 1
58 / 2027 WHat is the number for the player whose height is 2.01? ['No', 'Player', 'Height', 'Position', 'Year born', 'Current Club'] SELECT * FROM table WHERE player = number AND height = 2.01 SELECT COUNT Player FROM table WHERE Height = 2.01
59 / 2027 What No is the player Zoran Erceg ['No', 'Player', 'Height', 'Position', 'Year born', 'Current Club'] SELECT No FROM table WHERE player = Zoran Erceg SELECT MIN No FROM table WHERE Player = Zoran Erceg
60 / 2027 What's the smallest number of bronze medals that any one if the ensembles has?  ['Ensemble', 'Gold Medals', 'Silver Medals', 'Bronze Medals', 'Total Medals'] SELECT * FROM table WHERE ensemble = bronze SELECT MIN Bronze Medals FROM table
61 / 2027 1
62 / 2027 1
63 / 2027 1
64 / 2027 1
65 / 2027 What year was incumbent jim ramstad first elected? ['District', 'Incumbent', 'Party', 'First elected', 'Results', 'Candidatess'] SELECT first elected FROM table WHERE first elected = jim ramstad SELECT MIN First elected FROM table WHERE Incumbent = Jim Ramstad
66 / 2027 When was the incumbent Sherrod Brown first elected?  ['District', 'Incumbent', 'Party', 'First elected', 'Results', 'Candidates'] SELECT first elected FROM table WHERE first elected = Sherrod Brown SELECT MAX First elected FROM table WHERE Incumbent = Sherrod Brown
67 / 2027 1
68 / 2027 What is the last year that someone is first elected in this table? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT MAX first elected FROM table SELECT MAX First elected FROM table
69 / 2027 1
70 / 2027 1
71 / 2027 1
72 / 2027 When was the Tennessee 3 district incumbent first elected?  ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT first elected FROM table WHERE district = Tennessee 3 SELECT MAX First elected FROM table WHERE District = Tennessee 3
73 / 2027 1
74 / 2027 1
75 / 2027 What is the last year on this list someone was first elected? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT MAX first elected FROM table SELECT MAX First elected FROM table
76 / 2027 1
77 / 2027 1
78 / 2027 When was incumbent John N. Tillman first elected? ['District', 'Incumbent', 'Party', 'First elected', 'Result', 'Candidates'] SELECT first elected FROM table WHERE first elected = John N. Tillman SELECT MIN First elected FROM table WHERE Incumbent = John N. Tillman
79 / 2027 what is the minimum total with kerry % being 16.71% ['County', 'Bush #', 'Bush %', 'Kerry #', 'Kerry %', 'Others #', 'Others %', 'Total'] SELECT * FROM table WHERE kerry % = 16.71% SELECT MIN Total FROM table WHERE Kerry % = 16.71%
80 / 2027 what is the minimum kerry # with bush % being 78.40% ['County', 'Bush #', 'Bush %', 'Kerry #', 'Kerry %', 'Others #', 'Others %', 'Total'] SELECT * FROM table WHERE bush % = 78.40% SELECT MIN Kerry # FROM table WHERE Bush % = 78.40%
81 / 2027 1
82 / 2027 what is the minimum bush # with kerry # being 3938 ['County', 'Bush #', 'Bush %', 'Kerry #', 'Kerry %', 'Others #', 'Others %', 'Total'] SELECT * FROM table WHERE kerry # = 3938 SELECT MIN Bush # FROM table WHERE Kerry # = 3938
83 / 2027 1
84 / 2027 How many different results came out of the round in which #98 All American Racers became the GTU winning team?  ['Rnd', 'Circuit', 'GTP Winning Team', 'GTO Winning Team', 'GTU Winning Team', 'Results'] SELECT * FROM table WHERE gtu winning team = #98 All American Racers SELECT COUNT Results FROM table WHERE GTU Winning Team = #98 All American Racers
85 / 2027 1
86 / 2027 1
87 / 2027 1
88 / 2027 1
89 / 2027 what is the minimum district with incumbent being tom reynolds ['District', 'Incumbent', 'Party', 'Elected', 'Status', 'Opponent'] SELECT * FROM table WHERE incumbent = tom reynolds SELECT MIN District FROM table WHERE Incumbent = Tom Reynolds
90 / 2027 what is the minimum average with highest being 2363 ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE highest = 2363 SELECT MIN Average FROM table WHERE Highest = 2363
91 / 2027 what is the minimum lowest with highest being 2363 ['Team', 'Stadium', 'Capacity', 'Highest', 'Lowest', 'Average'] SELECT * FROM table WHERE highest = 2363 SELECT MIN Lowest FROM table WHERE Highest = 2363
92 / 2027 What's the tries against count of the team with 396 points against?  ['Club', 'Played', 'Won', 'Drawn', 'Lost', 'Points for', 'Points against', 'Tries for', 'Tries against', 'Try bonus', 'Losing bonus', 'Points'] SELECT tries against FROM table WHERE points against = 396 SELECT COUNT Tries against FROM table WHERE Points against = 396
93 / 2027 How many home losses occured when PF 13? ['Num', 'Team', 'W', 'L', 'PCT', 'PF', 'PA', 'Last appearance', 'Last championship', 'HOME games', 'Home wins', 'Home losses', 'Home Win Pct.', 'ROAD games', 'Road wins', 'Road losses', 'Road Win Pct.'] SELECT * FROM table WHERE l = home AND pf = PF 13 SELECT COUNT Home losses FROM table WHERE PF = 13
94 / 2027 what is the minimum attendance with stadium being cotton bowl ['Week', 'Date', 'Opponent', 'Result', 'Stadium', 'Record', 'Attendance'] SELECT * FROM table WHERE stadium = cotton bowl SELECT MIN Attendance FROM table WHERE Stadium = Cotton Bowl
95 / 2027 1
96 / 2027 what is the minimum attendance with record being 4–6 ['Week', 'Date', 'Opponent', 'Result', 'Stadium', 'Record', 'Attendance'] SELECT * FROM table WHERE record = 4–6 SELECT MIN Attendance FROM table WHERE Record = 4–6
97 / 2027 1
98 / 2027 what is the minimum population with canton being redange ['Map Key', 'Commune', 'Canton', 'District', 'Population'] SELECT * FROM table WHERE canton = redange SELECT MIN Population FROM table WHERE Canton = Redange
99 / 2027 1
100 / 2027 When the % of boundary by water is 63% what is the overall number of zip code prefix(es)? ['IN No.', 'County Name', 'Establishment Date (SW Indiana) (History) (Statehood)', 'County Seat', 'Time Zone', 'Population (2010) (Rank)', 'Area sq mi (km 2 ) (Rank)', 'Twps', 'ZIP code Prefix(es)', '% of Boundary by water'] SELECT * FROM table WHERE % of boundary by water = zip code SELECT COUNT ZIP code Prefix(es) FROM table WHERE % of Boundary by water = 63%
101 / 2027 1
102 / 2027 How many total smartphones were shipped during the quarter 2012 Q1? ['Quarter', 'Android', 'iOS', 'Symbian', 'BlackBerry OS', 'Linux', 'Windows Phone', 'Other', 'Total'] SELECT * FROM table WHERE quarter = 2012 Q1 SELECT COUNT Total FROM table WHERE Quarter = 2012 Q1
103 / 2027 How man "other" millions of smartphones were shipped when 181.1 million total were shipped? ['Quarter', 'Android', 'iOS', 'Symbian', 'BlackBerry OS', 'Linux', 'Windows Phone', 'Other', 'Total'] SELECT other FROM table WHERE total = 181.1 SELECT COUNT Other FROM table WHERE Total = 181.1
104 / 2027 What was the most extra points? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT MAX extra points FROM table SELECT MAX Extra points FROM table
105 / 2027 1
106 / 2027 1
107 / 2027 What is the least amount of field goals made by a player? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table SELECT MIN Field goals FROM table
108 / 2027 What is the least amount of extra points made in by a player? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table SELECT MIN Extra points FROM table
109 / 2027 what is the maximum number of points? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT MAX points FROM table SELECT MAX Points FROM table
110 / 2027 What is the highest number of extra points? ['Player', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT MAX extra points FROM table SELECT MAX Extra points FROM table
111 / 2027 How many field goals were made by someone playing position of right end? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT MAX field goals FROM table WHERE position = right end SELECT COUNT Field goals FROM table WHERE Position = Right end
112 / 2027 How many points were scored by someone who's position was right tackle? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT points FROM table WHERE position = right tackle SELECT COUNT Points FROM table WHERE Position = Right tackle
113 / 2027 What is the least amount of touchdowns scored on the chart? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table SELECT MIN Touchdowns FROM table
114 / 2027 How many touchdowns were scored by players who scored more than 5.0 extra points? ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT SUM touchdowns FROM table WHERE extra points = 5.0 SELECT COUNT Touchdowns FROM table WHERE Extra points > 5.0
115 / 2027 What is the lowest amount of field goals on the chart?  ['Player', 'Position', 'Starter', 'Touchdowns', 'Extra points', 'Field goals', 'Points'] SELECT * FROM table SELECT MIN Field goals FROM table

Our accuracy statistics for this case are as follows.

*   Select accuracy: 51.26%
*   Where accuracy: 69.46%
*   Value accuracy: 74.54%
*   Overall accuracy 36.16%

#Case 6: Operator Accuracy Evaluation
We evaluate the accuracy of our rule-based determine operator function which identifies which operator ('<', '>', '=') goes with which attribute-value pair in the WHERE clauses. We evaluate accuracy on the entire WikiSQL dataset below. Note that we are only evaluating the accuracy of operators here assuming that the WHERE attributes have already been identified correctly so we don't use any of our pre-defined rules or our NER model. We calculate accuracy using the following formula:

$$\frac{\text{#queries with correctly predicted operators in the WHERE clause}}{\text{#total queries}}$$


Because of a quirk in the WikiSQL dataset, about 50 queries have WHERE values that contain operators ("=", "<" and/or ">") in them. Therefore, the filter_invalid_operator_queries function ensures that those queries are ignored.

In [41]:
def filter_invalid_operator_queries():
  """Remove queries with values that have operators in them from the dataset."""
  validQueries = []
  for row in dataset['test']:
    question = row['question']
    sqlQuery = row['sql']['human_readable']
    columns = row['table']['header']

    question = remove_unicode_characters(question)
    sqlQuery = remove_unicode_characters(sqlQuery)
    sqlQuery = remove_quotes(sqlQuery)

    sqlExtractor = sqlExtract(sqlQuery)
    whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()

    flag = False
    allOperators = ['=', '>', '<']

    for operator in allOperators:
      for attr, value in whereAttrValue.items():
        if operator in attr or operator in value:
          flag = True
    if flag:
      continue

    validQueries.append({'question': question, 'sqlQuery': sqlQuery, 'attr': columns})
  return validQueries

In [42]:
validQueries = filter_invalid_operator_queries()
numQueries = len(validQueries)
print(numQueries)

15734

In [43]:
numCorrect = 0
count = 0
nlp = spacy.load("en_core_web_lg")

for query in validQueries:
  nlq = query['question']
  sqlQuery = query['sqlQuery']
  attributes = query['attr']

  sqlExtractor = sqlExtract(sqlQuery)

  whereIdx = sqlQuery.find('WHERE')
  if whereIdx == -1:
    whereAttrValue = {}
  else:
    whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()

  trueCompOperators = sqlExtractor.fetch_comparison_operator()

  nQueryObj = nlq2sql(question, "table", columns, nlp, nlp_ner, "rule1")
  nQueryObj.determine_operator(whereAttrValue)
  predictedCompOperators = nQueryObj.comparisonOperators

  if trueCompOperators != predictedCompOperators:
    print(f"{count} / {numQueries} {sqlQuery} {predictedCompOperators}")
  else:
    print(f"{count} / {numQueries} 1")
    numCorrect += 1

  count += 1

print('Operator accuracy', (numCorrect / numQueries) * 100)

Streaming output truncated to the last 5000 lines.
10735 / 15734 SELECT MIN Long FROM table WHERE Player = santana moss AND Att. > 1 ['=', '=']
10736 / 15734 1
10737 / 15734 SELECT SUM Yards FROM table WHERE Player = jason campbell AND Long < 23 ['=', '=']
10738 / 15734 1
10739 / 15734 1
10740 / 15734 1
10741 / 15734 1
10742 / 15734 1
10743 / 15734 1
10744 / 15734 1
10745 / 15734 1
10746 / 15734 1
10747 / 15734 1
10748 / 15734 1
10749 / 15734 SELECT Title FROM table WHERE Rating > 9.3 AND 18-49 < 5.5 AND Airdate = january 11, 2007 ['=', '=', '=']
10750 / 15734 SELECT SUM Viewers FROM table WHERE Rating > 7.8 AND Airdate = october 26, 2006 AND Share > 14 ['=', '=', '=']
10751 / 15734 SELECT MIN Viewers FROM table WHERE Episode = 2 AND 18-49 > 4.9 ['=', '=']
10752 / 15734 1
10753 / 15734 SELECT Mintage FROM table WHERE Artist = royal canadian mint engravers AND Year < 2008 AND Issue Price = $102.95 ['=', '=', '=']
10754 / 15734 SELECT Theme FROM table WHERE Year < 2006 AND Issue Price = $25.22 ['=', '=']
10755 / 15734 1
10756 / 15734 1
10757 / 15734 1
10758 / 15734 1
10759 / 15734 1
10760 / 15734 1
10761 / 15734 1
10762 / 15734 1
10763 / 15734 SELECT Venue FROM table WHERE Crowd > 25,000 AND Away team = carlton ['=', '=']
10764 / 15734 1
10765 / 15734 1
10766 / 15734 1
10767 / 15734 SELECT Free Agent Class FROM table WHERE Pick < 38 ['=']
10768 / 15734 1
10769 / 15734 1
10770 / 15734 SELECT Artist FROM table WHERE Issue Price (BU)[ clarification needed ] = n/a AND Year > 2004 AND Mintage (Proof) = 25,000 ['=', '=', '=']
10771 / 15734 1
10772 / 15734 SELECT Issue Price (BU)[ clarification needed ] FROM table WHERE Year > 2002 AND Mintage (Proof) = 50,000 ['=', '=']
10773 / 15734 1
10774 / 15734 1
10775 / 15734 SELECT AVG Total FROM table WHERE Tournament > 2 AND Regular Season = 1 ['=', '=']
10776 / 15734 SELECT COUNT Tournament FROM table WHERE Total > 0 AND Team = texas ['=', '=']
10777 / 15734 SELECT Season FROM table WHERE Tournament > 2 AND Regular Season = 13 ['=', '=']
10778 / 15734 1
10779 / 15734 1
10780 / 15734 1
10781 / 15734 1
10782 / 15734 1
10783 / 15734 1
10784 / 15734 SELECT COUNT Rank FROM table WHERE Swing to gain < 6.92 AND Constituency = caerphilly ['=', '=']
10785 / 15734 SELECT SUM Swing to gain FROM table WHERE Winning party 2007 = conservative AND Rank < 5 ['=', '=']
10786 / 15734 SELECT Director FROM table WHERE Year < 1949 AND Leading Lady = linda darnell AND Role = jonathan kent ['=', '=', '=']
10787 / 15734 1
10788 / 15734 SELECT Title FROM table WHERE Director = rouben mamoulian AND Year > 1940 AND Leading Lady = linda darnell ['=', '=', '=']
10789 / 15734 SELECT Director FROM table WHERE Year < 1948 AND Leading Lady = linda darnell AND Title = blood and sand ['=', '=', '=']
10790 / 15734 SELECT Driver FROM table WHERE Laps = 3 AND Grid < 15 ['=', '=']
10791 / 15734 SELECT Time/Retired FROM table WHERE Grid < 22 AND Laps < 33 AND Driver = john surtees ['=', '=', '=']
10792 / 15734 1
10793 / 15734 1
10794 / 15734 1
10795 / 15734 1
10796 / 15734 1
10797 / 15734 SELECT Super G FROM table WHERE Slalom < 5 AND Giant Slalom = 1 ['=', '=']
10798 / 15734 1
10799 / 15734 1
10800 / 15734 1
10801 / 15734 1
10802 / 15734 1
10803 / 15734 1
10804 / 15734 1
10805 / 15734 SELECT MIN Attendance FROM table WHERE Date = october 13, 1968 AND Week > 5 ['=', '=']
10806 / 15734 1
10807 / 15734 SELECT COUNT Attendance FROM table WHERE Date = november 3, 1968 AND Week < 8 ['=', '=']
10808 / 15734 1
10809 / 15734 1
10810 / 15734 1
10811 / 15734 1
10812 / 15734 1
10813 / 15734 1
10814 / 15734 1
10815 / 15734 1
10816 / 15734 1
10817 / 15734 SELECT Chassis FROM table WHERE Year > 1989 ['=']
10818 / 15734 1
10819 / 15734 1
10820 / 15734 1
10821 / 15734 SELECT Opponent FROM table WHERE Attendance > 59,000 ['=']
10822 / 15734 1
10823 / 15734 SELECT SUM Appearances FROM table WHERE Team = psv eindhoven AND Rank < 11 ['=', '=']
10824 / 15734 1
10825 / 15734 1
10826 / 15734 1
10827 / 15734 SELECT Opponent FROM table WHERE Round > 4 AND Event = draka v ['=', '=']
10828 / 15734 1
10829 / 15734 1
10830 / 15734 1
10831 / 15734 1
10832 / 15734 1
10833 / 15734 SELECT AVG Games FROM table WHERE Lost > 27 AND Points < 78 AND Goals against < 300 ['=', '=', '=']
10834 / 15734 SELECT COUNT Games FROM table WHERE Tied < 15 AND Goals against < 186 ['=', '=']
10835 / 15734 SELECT MIN Goals for FROM table WHERE Tied > 15 ['=']
10836 / 15734 1
10837 / 15734 SELECT MIN Gold FROM table WHERE Rank < 5 AND Silver = 1 AND Nation = poland AND Total > 1 ['=', '=', '=', '=']
10838 / 15734 SELECT COUNT Silver FROM table WHERE Gold = 3 AND Rank > 1 ['=', '=']
10839 / 15734 SELECT AVG Gold FROM table WHERE Bronze > 1 ['=']
10840 / 15734 SELECT AVG Silver FROM table WHERE Rank = 2 AND Bronze > 1 ['=', '=']
10841 / 15734 1
10842 / 15734 1
10843 / 15734 SELECT Winner FROM table WHERE Majority > 6,181 AND Runner up = j w andrews ['=', '=']
10844 / 15734 1
10845 / 15734 1
10846 / 15734 1
10847 / 15734 1
10848 / 15734 SELECT Asts FROM table WHERE Rebs > 1,189 ['=']
10849 / 15734 1
10850 / 15734 1
10851 / 15734 1
10852 / 15734 1
10853 / 15734 1
10854 / 15734 SELECT Rank FROM table WHERE Year < 2000 AND Bike = bsl ['=', '=']
10855 / 15734 1
10856 / 15734 1
10857 / 15734 1
10858 / 15734 1
10859 / 15734 1
10860 / 15734 SELECT MIN Not Outs FROM table WHERE Average < 31.25 AND Matches < 13 AND Runs < 327 ['=', '=', '=']
10861 / 15734 SELECT COUNT Runs FROM table WHERE Average > 31.25 AND Innings < 24 ['=', '=']
10862 / 15734 SELECT MIN Not Outs FROM table WHERE Innings > 25 ['=']
10863 / 15734 SELECT Not Outs FROM table WHERE Runs > 327 AND Innings > 24 AND Average = 29.54 ['=', '=', '=']
10864 / 15734 SELECT COUNT Runs FROM table WHERE Average < 27.22 ['=']
10865 / 15734 1
10866 / 15734 1
10867 / 15734 1
10868 / 15734 1
10869 / 15734 1
10870 / 15734 1
10871 / 15734 1
10872 / 15734 1
10873 / 15734 1
10874 / 15734 1
10875 / 15734 1
10876 / 15734 1
10877 / 15734 1
10878 / 15734 1
10879 / 15734 SELECT Result FROM table WHERE Scored > 1 ['=']
10880 / 15734 1
10881 / 15734 1
10882 / 15734 1
10883 / 15734 1
10884 / 15734 1
10885 / 15734 1
10886 / 15734 1
10887 / 15734 1
10888 / 15734 1
10889 / 15734 1
10890 / 15734 1
10891 / 15734 1
10892 / 15734 1
10893 / 15734 1
10894 / 15734 1
10895 / 15734 1
10896 / 15734 1
10897 / 15734 1
10898 / 15734 1
10899 / 15734 1
10900 / 15734 SELECT Result FROM table WHERE Year < 2010 AND Tournament = hypo-meeting ['=', '=']
10901 / 15734 SELECT Venue FROM table WHERE Result = 12th AND Year < 2012 ['=', '=']
10902 / 15734 1
10903 / 15734 1
10904 / 15734 1
10905 / 15734 1
10906 / 15734 1
10907 / 15734 SELECT Category FROM table WHERE Character = jacqui mcqueen AND Year < 2011 ['=', '=']
10908 / 15734 1
10909 / 15734 1
10910 / 15734 1
10911 / 15734 1
10912 / 15734 1
10913 / 15734 1
10914 / 15734 1
10915 / 15734 1
10916 / 15734 1
10917 / 15734 1
10918 / 15734 1
10919 / 15734 1
10920 / 15734 1
10921 / 15734 1
10922 / 15734 1
10923 / 15734 1
10924 / 15734 1
10925 / 15734 1
10926 / 15734 1
10927 / 15734 SELECT Home team FROM table WHERE Crowd > 22,449 ['=']
10928 / 15734 1
10929 / 15734 1
10930 / 15734 1
10931 / 15734 1
10932 / 15734 SELECT MIN Utility PV FROM table WHERE Hydro > 289.25 AND Renewable Total > 520.07 ['=', '=']
10933 / 15734 1
10934 / 15734 1
10935 / 15734 1
10936 / 15734 SELECT LNER class FROM table WHERE Passed to LNER > 3 AND Date introduced = 1895–98 ['=', '=']
10937 / 15734 1
10938 / 15734 1
10939 / 15734 1
10940 / 15734 1
10941 / 15734 1
10942 / 15734 1
10943 / 15734 1
10944 / 15734 1
10945 / 15734 SELECT MIN 1960 FROM table WHERE 1940 = 1,115 AND 1990 < 928 ['=', '=']
10946 / 15734 SELECT MAX 1920 FROM table WHERE 2000 = 5,030 AND 1960 > 4,228 ['=', '=']
10947 / 15734 SELECT SUM 1970 FROM table WHERE 1960 < 4,228 AND 1920 < 106,021,568 AND 1980 > 949 ['=', '=', '=']
10948 / 15734 SELECT MIN 1930 FROM table WHERE 1990 = 6,883 AND 1920 > 6,215 ['=', '=']
10949 / 15734 SELECT AVG 1940 FROM table WHERE 1970 > 11,070 AND 1950 < 150,844,547 ['=', '=']
10950 / 15734 SELECT AVG Fumbles FROM table WHERE Avg. > 5.4 AND Yards < 164 ['=', '=']
10951 / 15734 SELECT MAX Fumbles FROM table WHERE Yards > 44 AND Att. = 32 ['=', '=']
10952 / 15734 SELECT Entrant FROM table WHERE Year > 1981 AND Chassis = osella fa1c ['=', '=']
10953 / 15734 1
10954 / 15734 1
10955 / 15734 1
10956 / 15734 1
10957 / 15734 1
10958 / 15734 1
10959 / 15734 1
10960 / 15734 1
10961 / 15734 SELECT Time/Retired FROM table WHERE Laps < 52 AND Grid = 19 ['=', '=']
10962 / 15734 SELECT Driver FROM table WHERE Laps > 39 AND Grid = 15 ['=', '=']
10963 / 15734 SELECT SUM Grid FROM table WHERE Driver = johnny herbert AND Laps > 52 ['=', '=']
10964 / 15734 1
10965 / 15734 1
10966 / 15734 1
10967 / 15734 1
10968 / 15734 1
10969 / 15734 1
10970 / 15734 1
10971 / 15734 1
10972 / 15734 1
10973 / 15734 1
10974 / 15734 1
10975 / 15734 1
10976 / 15734 1
10977 / 15734 SELECT MIN Class Position FROM table WHERE Drivers = les palmer, terry morris AND Position > 23 ['=', '=']
10978 / 15734 SELECT Class FROM table WHERE Laps > 193 AND Class Position = 1 AND Position = 13 ['=', '=', '=']
10979 / 15734 1
10980 / 15734 1
10981 / 15734 1
10982 / 15734 1
10983 / 15734 SELECT MAX Region FROM table WHERE Name = saint-simon-les-mines AND Population < 458 ['=', '=']
10984 / 15734 SELECT SUM Region FROM table WHERE Name = saint-agapit AND Code < 33045 ['=', '=']
10985 / 15734 SELECT AVG Area (km 2 ) FROM table WHERE Code > 19025 AND Region < 12 ['=', '=']
10986 / 15734 SELECT MAX Region FROM table WHERE Name = saint-flavien AND Area (km 2 ) > 67.56 ['=', '=']
10987 / 15734 1
10988 / 15734 1
10989 / 15734 1
10990 / 15734 1
10991 / 15734 1
10992 / 15734 SELECT MAX Region FROM table WHERE Population < 4,797 AND Name = l'ascension-de-notre-seigneur AND Area (km 2 ) > 131.83 ['=', '=', '=']
10993 / 15734 SELECT AVG Population FROM table WHERE Regional County Municipality = le domaine-du-roy AND Type = m AND Region < 2 ['=', '=', '=']
10994 / 15734 SELECT Regional County Municipality FROM table WHERE Type = m AND Code < 91015 ['=', '=']
10995 / 15734 1
10996 / 15734 1
10997 / 15734 1
10998 / 15734 1
10999 / 15734 1
11000 / 15734 1
11001 / 15734 1
11002 / 15734 SELECT Away team FROM table WHERE Crowd > 25,000 ['=']
11003 / 15734 1
11004 / 15734 1
11005 / 15734 1
11006 / 15734 1
11007 / 15734 1
11008 / 15734 SELECT MAX Clean & jerk FROM table WHERE Snatch < 150 AND Bodyweight > 93.13 ['=', '=']
11009 / 15734 SELECT Name FROM table WHERE Bodyweight > 89.64 AND Total (kg) > 310 AND Clean & jerk < 207.5 AND Snatch > 165 ['=', '=', '=', '=']
11010 / 15734 1
11011 / 15734 1
11012 / 15734 1
11013 / 15734 1
11014 / 15734 SELECT Country of origin* FROM table WHERE Pick < 26 AND PBA team = shell turbo chargers ['=', '=']
11015 / 15734 1
11016 / 15734 1
11017 / 15734 1
11018 / 15734 1
11019 / 15734 1
11020 / 15734 1
11021 / 15734 1
11022 / 15734 1
11023 / 15734 1
11024 / 15734 1
11025 / 15734 1
11026 / 15734 1
11027 / 15734 1
11028 / 15734 1
11029 / 15734 1
11030 / 15734 1
11031 / 15734 1
11032 / 15734 SELECT COUNT Laps FROM table WHERE Driver = ukyo katayama AND Grid < 16 ['=', '=']
11033 / 15734 1
11034 / 15734 1
11035 / 15734 1
11036 / 15734 1
11037 / 15734 1
11038 / 15734 1
11039 / 15734 1
11040 / 15734 1
11041 / 15734 1
11042 / 15734 1
11043 / 15734 1
11044 / 15734 1
11045 / 15734 1
11046 / 15734 1
11047 / 15734 SELECT Away team score FROM table WHERE Crowd > 22,283 AND Home team score = 23.13 (151) ['=', '=']
11048 / 15734 1
11049 / 15734 1
11050 / 15734 1
11051 / 15734 SELECT SUM Area (km²) FROM table WHERE Median age (in 2006) = 38 years AND Population (in 2008) = 2,444 AND Date first settled as a suburb < 1965 ['=', '=', '=']
11052 / 15734 1
11053 / 15734 1
11054 / 15734 1
11055 / 15734 1
11056 / 15734 1
11057 / 15734 SELECT COUNT Percent Yes FROM table WHERE Voted Yes > 2,410,119 AND Jurisdiction = nova scotia AND Percent No < 51.3 ['=', '=', '=']
11058 / 15734 SELECT COUNT Percent Yes FROM table WHERE Jurisdiction = alberta AND Percent No > 60.2 ['=', '=']
11059 / 15734 SELECT COUNT Voted Yes FROM table WHERE Jurisdiction = newfoundland AND Voted No < 77,881 ['=', '=']
11060 / 15734 SELECT MAX Percent Yes FROM table WHERE Jurisdiction = alberta AND Percent No < 60.2 ['=', '=']
11061 / 15734 SELECT MAX Percent Yes FROM table WHERE Voted Yes < 5,354 AND Jurisdiction = alberta AND Voted No < 731,975 ['=', '=', '=']
11062 / 15734 1
11063 / 15734 1
11064 / 15734 SELECT Date FROM table WHERE Crowd > 16,000 AND Home team = carlton ['=', '=']
11065 / 15734 1
11066 / 15734 1
11067 / 15734 1
11068 / 15734 1
11069 / 15734 1
11070 / 15734 1
11071 / 15734 1
11072 / 15734 1
11073 / 15734 1
11074 / 15734 1
11075 / 15734 1
11076 / 15734 1
11077 / 15734 1
11078 / 15734 1
11079 / 15734 SELECT Opponent FROM table WHERE Week < 12 AND Attendance = 65,569 ['=', '=']
11080 / 15734 1
11081 / 15734 1
11082 / 15734 1
11083 / 15734 1
11084 / 15734 1
11085 / 15734 SELECT Composition FROM table WHERE Mintage > 999 AND Artist = jody broomfield AND Year > 2008 ['=', '=', '=']
11086 / 15734 SELECT Theme FROM table WHERE Year < 2006 ['=']
11087 / 15734 1
11088 / 15734 1
11089 / 15734 1
11090 / 15734 1
11091 / 15734 SELECT Originally aired FROM table WHERE Season < 5 AND Season Premiere = october 3, 2001 ['=', '=']
11092 / 15734 1
11093 / 15734 SELECT MIN Lost FROM table WHERE Drawn < 1 AND % Won = 50% AND Against = netherlands AND Played > 2 ['=', '=', '=', '=']
11094 / 15734 1
11095 / 15734 1
11096 / 15734 SELECT AVG Interview FROM table WHERE Average > 9.233 AND Swimsuit = 9.473 AND Evening Gown > 9.671 ['=', '=', '=']
11097 / 15734 SELECT MIN Evening Gown FROM table WHERE Interview > 9.164 AND Swimsuit < 9.35 AND Average < 9.233 ['=', '=', '=']
11098 / 15734 SELECT MAX Average FROM table WHERE Swimsuit = 9.4 AND Evening Gown < 9.486 ['=', '=']
11099 / 15734 SELECT SUM Interview FROM table WHERE Evening Gown = 9.543 AND Average > 9.521 ['=', '=']
11100 / 15734 SELECT AVG Average FROM table WHERE Evening Gown > 9.35 AND State = south carolina AND Swimsuit > 9.4 ['=', '=', '=']
11101 / 15734 SELECT SUM Draws FROM table WHERE Goals against = 52 AND Losses < 15 ['=', '=']
11102 / 15734 SELECT MAX Losses FROM table WHERE Club = cd toledo AND Points > 56 ['=', '=']
11103 / 15734 SELECT MIN Wins FROM table WHERE Goals for > 72 ['=']
11104 / 15734 1
11105 / 15734 SELECT Name FROM table WHERE Snatch > 140 AND Bodyweight < 84.55 AND Clean & jerk = 192.5 ['=', '=', '=']
11106 / 15734 1
11107 / 15734 1
11108 / 15734 SELECT MIN +1d12 (6) FROM table WHERE Difficulty Value = competent (dv 8) AND 1d10 Resolution (+5) > 13 ['=', '=']
11109 / 15734 SELECT MAX 3d6 or 1d20 Resolution (+10) FROM table WHERE 1d10 Resolution (+5) = 5 AND +1d12 (6) < 6 ['=', '=']
11110 / 15734 SELECT MAX +1d12 (6) FROM table WHERE 3d6 or 1d20 Resolution (+10) > 10 AND +1d6-1d6 or +1d10-1d10 (+0) = 4 AND 1d10 Resolution (+5) > 9 ['=', '=', '=']
11111 / 15734 1
11112 / 15734 1
11113 / 15734 1
11114 / 15734 1
11115 / 15734 1
11116 / 15734 1
11117 / 15734 1
11118 / 15734 SELECT Club team FROM table WHERE Overall < 283 AND Player = derrick byfuglien ['=', '=']
11119 / 15734 1
11120 / 15734 1
11121 / 15734 1
11122 / 15734 1
11123 / 15734 1
11124 / 15734 1
11125 / 15734 SELECT Date FROM table WHERE Crowd > 23,000 ['=']
11126 / 15734 1
11127 / 15734 1
11128 / 15734 1
11129 / 15734 1
11130 / 15734 SELECT AVG Stories FROM table WHERE Completed > 2003 AND Rank = 16 ['=', '=']
11131 / 15734 1
11132 / 15734 SELECT SUM Stories FROM table WHERE City = guadalajara AND Completed > 2007 ['=', '=']
11133 / 15734 SELECT State FROM table WHERE Council votes < 4 ['=']
11134 / 15734 1
11135 / 15734 1
11136 / 15734 1
11137 / 15734 1
11138 / 15734 SELECT COUNT Grid FROM table WHERE Laps > 54 ['=']
11139 / 15734 1
11140 / 15734 SELECT Constructor FROM table WHERE Grid > 8 AND Time/Retired = +1:17.124 ['=', '=']
11141 / 15734 1
11142 / 15734 SELECT Engine FROM table WHERE Year < 1996 AND Points = 5 ['=', '=']
11143 / 15734 SELECT COUNT Year FROM table WHERE Entrant = red bull sauber petronas AND Points > 6 ['=', '=']
11144 / 15734 1
11145 / 15734 1
11146 / 15734 1
11147 / 15734 SELECT Date FROM table WHERE Crowd > 17,259 AND Away team = melbourne ['=', '=']
11148 / 15734 1
11149 / 15734 1
11150 / 15734 1
11151 / 15734 1
11152 / 15734 1
11153 / 15734 1
11154 / 15734 1
11155 / 15734 1
11156 / 15734 SELECT Pos. FROM table WHERE Asts > 11 AND Rebs = 219 ['=', '=']
11157 / 15734 1
11158 / 15734 1
11159 / 15734 1
11160 / 15734 1
11161 / 15734 1
11162 / 15734 1
11163 / 15734 1
11164 / 15734 1
11165 / 15734 1
11166 / 15734 1
11167 / 15734 SELECT MAX Population Estimate 2005 FROM table WHERE Area (km 2 ) > 1,775.65 AND Name = mamasa regency AND Population Census 2010 < 139,962 ['=', '=', '=']
11168 / 15734 1
11169 / 15734 SELECT MAX Area (km 2 ) FROM table WHERE Population Estimate 2005 < 93,116 AND Name = polewali mandar regency ['=', '=']
11170 / 15734 1
11171 / 15734 SELECT COUNT Population Estimate 2005 FROM table WHERE Area (km 2 ) > 8,023.74 ['=']
11172 / 15734 1
11173 / 15734 SELECT Leading scorer FROM table WHERE Attendance > 12,107 AND Date = 4 april 2008 ['=', '=']
11174 / 15734 SELECT Home team score FROM table WHERE Crowd > 18,000 AND Venue = victoria park ['=', '=']
11175 / 15734 1
11176 / 15734 SELECT MIN Season FROM table WHERE TV Season = 2010-2011 AND Viewers (in millions) < 3.6 ['=', '=']
11177 / 15734 1
11178 / 15734 1
11179 / 15734 SELECT Rank FROM table WHERE Viewers (in millions) < 6.2 AND TV Season = 2009-2010 ['=', '=']
11180 / 15734 1
11181 / 15734 1
11182 / 15734 1
11183 / 15734 1
11184 / 15734 1
11185 / 15734 1
11186 / 15734 1
11187 / 15734 SELECT Genre FROM table WHERE Number of episodes > 20 AND English title (Chinese title) = wong fei hung - master of kung fu 我師傅係黃飛鴻 ['=', '=']
11188 / 15734 1
11189 / 15734 1
11190 / 15734 1
11191 / 15734 1
11192 / 15734 1
11193 / 15734 1
11194 / 15734 1
11195 / 15734 1
11196 / 15734 1
11197 / 15734 1
11198 / 15734 1
11199 / 15734 1
11200 / 15734 1
11201 / 15734 1
11202 / 15734 1
11203 / 15734 1
11204 / 15734 1
11205 / 15734 1
11206 / 15734 1
11207 / 15734 1
11208 / 15734 1
11209 / 15734 1
11210 / 15734 1
11211 / 15734 1
11212 / 15734 1
11213 / 15734 1
11214 / 15734 1
11215 / 15734 1
11216 / 15734 1
11217 / 15734 SELECT SUM Draw FROM table WHERE Artist = hari mata hari AND Points < 70 ['=', '=']
11218 / 15734 SELECT MAX Points FROM table WHERE Draw < 7 AND Song = budi tu ['=', '=']
11219 / 15734 1
11220 / 15734 SELECT MIN Place FROM table WHERE Song = starac i more AND Draw > 13 ['=', '=']
11221 / 15734 1
11222 / 15734 1
11223 / 15734 1
11224 / 15734 1
11225 / 15734 1
11226 / 15734 1
11227 / 15734 1
11228 / 15734 1
11229 / 15734 1
11230 / 15734 1
11231 / 15734 1
11232 / 15734 SELECT Constructor FROM table WHERE Grid < 18 AND Driver = mika häkkinen ['=', '=']
11233 / 15734 SELECT AVG Laps FROM table WHERE Driver = damon hill AND Grid < 1 ['=', '=']
11234 / 15734 1
11235 / 15734 SELECT AVG Games Played FROM table WHERE Team = ottawa hockey club AND Wins > 5 ['=', '=']
11236 / 15734 SELECT AVG Goals Against FROM table WHERE Games Played < 8 ['=']
11237 / 15734 SELECT COUNT Wins FROM table WHERE Goals For > 35 AND Team = montreal hockey club AND Losses < 2 ['=', '=', '=']
11238 / 15734 1
11239 / 15734 SELECT COUNT Week FROM table WHERE Date = december 9, 1961 AND Attendance > 41,268 ['=', '=']
11240 / 15734 SELECT COUNT Seats 2001 FROM table WHERE % 2006 < 8.6 ['=']
11241 / 15734 SELECT SUM Seats 2001 FROM table WHERE Seats 2006 = 2 AND % 2001 > 7.6 ['=', '=']
11242 / 15734 SELECT Date FROM table WHERE Attendance > 20,737 AND Loss = dawley (2-3) ['=', '=']
11243 / 15734 1
11244 / 15734 SELECT Format FROM table WHERE Year > 1991 AND Catalog Number = 81868 ['=', '=']
11245 / 15734 1
11246 / 15734 1
11247 / 15734 SELECT COUNT Laps FROM table WHERE Time/Retired = received outside assistance AND Grid < 19 ['=', '=']
11248 / 15734 1
11249 / 15734 1
11250 / 15734 SELECT AVG Tries FROM table WHERE Player = mike forshaw AND Points < 28 ['=', '=']

Our accuracy statistics for this case are as follows.

*   Overall accuracy 81.42%

# Case 8: WHERE Attribute Classification Accuracy

We evaluate the accuracy of our word-embedding-based approach to handle NLQs where the attribute associated with an identified value in the expected WHERE clause isn't explicitly mentioned in the NLQ. In this approach, we find the attribute that has the greatest cosine similarity with the identified value and associate that attribute with the identified value. We calculate accuracy using the following formula:

$$\frac{\text{#values for which attributes were correctly predicted}}{\text{#total values evaluated}}$$

Note that we assume the values have been correctly identified in this section so we don't use our nlp_ner model to identify constraints even though we pass the model to the nlq2sql class.

We only count a value to be evaluated if predicting an attribute was possible for that value. Sometimes, predicting an attribute is impossible because there is no word embedding for a token in the value or attribute.

We also calculate the number of queries for which at least one value didn't have an attribute predicted as a percentage of the total number of queries.

In [33]:
tagTestSet = obtain_absent_where_attr_queries()
print(len(tagTestSet))

100%|██████████| 15878/15878 [00:06<00:00, 2514.66it/s]

4655
4655

We download [GloVe](https://nlp.stanford.edu/projects/glove/) word embeddings.

In [49]:
import gensim.downloader
embed = gensim.downloader.load("glove-wiki-gigaword-200")

[==================================================] 100.0% 252.1/252.1MB downloaded

In [59]:
numValuesEvaluated = 0
numCorrect = 0
unevaluatedValueQueries = 0
nlp = spacy.load("en_core_web_lg")
i = 0
for obj in tagTestSet:
  i += 1
  sqlQuery = remove_quotes(obj['sqlQuery'])
  attributes = obj['attr']
  nlq = obj['question']
  nQueryObj = nlq2sql(nlq, "table", attributes, nlp, nlp_ner)
  sqlExtractor = sqlExtract(sqlQuery)
  whereAttr, whereAttrValue = sqlExtractor.fetch_where_attr()
  unevaluatedIndicator = False
  for attr, value in whereAttrValue.items():
    mostSimilarAttr = nQueryObj.get_most_similar_attribute(value, embed)
    if mostSimilarAttr is not None:
      numValuesEvaluated += 1
      if mostSimilarAttr.lower() == attr.lower():
        numCorrect += 1
        print(f"{i} / {len(tagTestSet)} 1")
      else:
        print(f"{i} / {len(tagTestSet)} Value: {value} Pred: {mostSimilarAttr.lower()} Correct: {attr.lower()}")
    else:
      print(f"{i} / {len(tagTestSet)} Value: {value} Pred: {mostSimilarAttr} Correct: {attr.lower()}")
      unevaluatedIndicator = True
  if unevaluatedIndicator:
    unevaluatedValueQueries += 1
if numValuesEvaluated > 0:
  print(f"Attribute Classification Accuracy: {(numCorrect / numValuesEvaluated) * 100}")
  print(f"% of queries where at least 1 value was not evaluated: {((len(tagTestSet) - unevaluatedValueQueries)/ len(tagTestSet)) * 100}")
else:
  print("0 queries evaluated.")

Streaming output truncated to the last 5000 lines.
1504 / 4655 Value: milwaukee county stadium Pred: attendance Correct: game site
1505 / 4655 Value: ontario Pred: shot pct. Correct: locale
1506 / 4655 Value: 77 Pred: ends lost Correct: shot pct.
1506 / 4655 Value: 11 Pred: shot pct. Correct: blank ends
1506 / 4655 Value: 7 Pred: shot pct. Correct: stolen ends
1506 / 4655 Value: 44 Pred: ends lost Correct: ends won
1507 / 4655 Value: the netherlands Pred: market value ( usd million) Correct: headquarters
1508 / 4655 1
1508 / 4655 Value: 23 Pred: seasons Correct: 3rd places
1509 / 4655 1
1509 / 4655 1
1510 / 4655 Value: dodge Pred: driver Correct: make
1511 / 4655 1
1512 / 4655 1
1513 / 4655 1
1513 / 4655 1
1514 / 4655 1
1514 / 4655 Value: 17 Pred: season Correct: podiums
1514 / 4655 Value: 0 Pred: wins Correct: fastest laps
1515 / 4655 1
1516 / 4655 1
1517 / 4655 Value: 6 Pred: year Correct: rank
1517 / 4655 Value: 617 / 188 Pred: year Correct: height feet / m
1518 / 4655 1
1518 / 4655 Value: 7 Pred: all years of finals appearances Correct: number of finals appearances
1519 / 4655 1
1519 / 4655 Value: 203 Pred: pick # Correct: overall
1520 / 4655 1
1520 / 4655 Value: 166 Pred: pick # Correct: overall
1521 / 4655 Value: 1 Pred: total Correct: bronze
1521 / 4655 Value: 4 Pred: total Correct: gold
1522 / 4655 Value: 1 Pred: earnings ( $ ) Correct: rank
1522 / 4655 1
1522 / 4655 Value: 6,028,927 Pred: None Correct: earnings ( $ )
1523 / 4655 1
1523 / 4655 Value: kbdr Pred: None Correct: callsign
1524 / 4655 Value: beijing Pred: launch Correct: origin
1525 / 4655 1
1525 / 4655 Value: 厦门卫视 Pred: None Correct: hanzi
1526 / 4655 1
1527 / 4655 1
1528 / 4655 1
1529 / 4655 1
1530 / 4655 Value: philadelphia flyers Pred: game Correct: opponent
1531 / 4655 Value: 424,000 Pred: peak Correct: sales
1531 / 4655 Value: elbow Pred: position Correct: artist
1532 / 4655 Value: stadion prljanije Pred: None Correct: venue
1533 / 4655 Value: retired republican hold Pred: party Correct: result
1533 / 4655 Value: rufus p. spalding Pred: district Correct: incumbent
1534 / 4655 Value: retired republican hold Pred: party Correct: result
1534 / 4655 Value: rufus p. spalding Pred: district Correct: incumbent
1535 / 4655 Value: marco simoncelli Pred: laps Correct: rider
1535 / 4655 Value: 11 Pred: time/retired Correct: grid
1536 / 4655 1
1537 / 4655 Value: – Pred: total Correct: hereditary peers
1537 / 4655 Value: – Pred: total Correct: lords spiritual
1537 / 4655 Value: 2 Pred: total Correct: life peers
1537 / 4655 1
1538 / 4655 1
1539 / 4655 1
1540 / 4655 Value: umbrellas Pred: netflix Correct: segment a
1541 / 4655 Value: rossville Pred: mascot Correct: location
1542 / 4655 Value: 2:06 Pred: opponent Correct: time
1542 / 4655 Value: njkf magnam 16 Pred: None Correct: event
1543 / 4655 Value: st. louis blues Pred: score Correct: opponent
1543 / 4655 Value: 58 Pred: record Correct: game
1544 / 4655 Value: larry mcmorran Pred: nationality Correct: player
1545 / 4655 1
1546 / 4655 1
1547 / 4655 Value: edmonton oilers Pred: score Correct: home
1547 / 4655 Value: chicago blackhawks Pred: score Correct: visitor
1547 / 4655 1
1548 / 4655 1
1549 / 4655 1
1550 / 4655 Value: charles van wyck Pred: district Correct: incumbent
1551 / 4655 1
1551 / 4655 1
1551 / 4655 1
1552 / 4655 Value: november 5, 1995 Pred: opponent in the final Correct: date
1553 / 4655 Value: amy frazier Pred: tournament Correct: opponent in the final
1554 / 4655 1
1555 / 4655 1
1556 / 4655 1
1557 / 4655 1
1558 / 4655 Value: mapei-clas Pred: points classification Correct: team classification
1558 / 4655 Value: 12 Pred: winner Correct: stage
1559 / 4655 Value: banesto Pred: stage Correct: team classification
1559 / 4655 Value: tony rominger Pred: stage Correct: points classification
1560 / 4655 1
1560 / 4655 Value: patricia tarabini Pred: outcome Correct: partner
1560 / 4655 1
1561 / 4655 1
1562 / 4655 Value: ucla Pred: mls team Correct: affiliation
1563 / 4655 Value: american civil war and indian wars Pred: rank order Correct: active service
1564 / 4655 Value: 001 1st Pred: first season of current spell in top division Correct: position in 2012–13
1565 / 4655 Value: 5 february 1979 Pred: first Correct: d.o.b.
1566 / 4655 Value: r Pred: first Correct: throws
1566 / 4655 1
1566 / 4655 Value: 26 april 1989 Pred: first Correct: d.o.b.
1567 / 4655 Value: pj Pred: throws Correct: first
1568 / 4655 1
1569 / 4655 Value: 5 Pred: year Correct: losses
1569 / 4655 Value: 0 Pred: points Correct: draws
1570 / 4655 Value: himco dump Pred: None Correct: name
1571 / 4655 1
1572 / 4655 Value: suzuki Pred: wins Correct: team
1572 / 4655 1
1572 / 4655 Value: 0 Pred: points Correct: wins
1573 / 4655 1
1573 / 4655 Value: lucky strike yamaha Pred: machine Correct: team
1573 / 4655 Value: 6 Pred: year Correct: points
1574 / 4655 1
1575 / 4655 1
1575 / 4655 Value: 60 Pred: record Correct: game
1575 / 4655 Value: new york islanders Pred: game Correct: opponent
1576 / 4655 Value: feb 10 Pred: 1st prize ( $ ) Correct: date
1577 / 4655 1
1577 / 4655 1
1578 / 4655 Value: h.e.b. texas open Pred: None Correct: tournament
1579 / 4655 1
1579 / 4655 Value: jeremy case Pred: year Correct: name
1580 / 4655 1
1581 / 4655 1
1581 / 4655 Value: mario chalmers Pred: position Correct: name
1582 / 4655 1
1583 / 4655 Value: runner-up Pred: score Correct: outcome
1583 / 4655 1
1584 / 4655 1
1585 / 4655 Value: 9 Pred: pct. Correct: mrc championships
1585 / 4655 Value: 192-189-3 Pred: pct. Correct: records
1585 / 4655 Value: 4 Pred: pct. Correct: co-champions
1586 / 4655 Value: 0.786 Pred: None Correct: pct.
1586 / 4655 Value: 6 Pred: pct. Correct: mrc championships
1586 / 4655 Value: 88-45-6 Pred: pct. Correct: records
1587 / 4655 Value: chicago black hawks Pred: game Correct: opponent
1588 / 4655 Value: cherry creek radio Pred: format Correct: owner
1588 / 4655 1
1589 / 4655 Value: st. george Pred: owner Correct: city of license
1589 / 4655 1
1590 / 4655 Value: marcelo filippini mark koevermans Pred: partnering Correct: opponents in the final
1591 / 4655 1
1591 / 4655 Value: march 28, 1995 Pred: opponents in the final Correct: date
1592 / 4655 Value: jordi arrese àlex corretja Pred: tournament Correct: opponents in the final
1593 / 4655 Value: t9 Pred: to par Correct: place
1593 / 4655 1
1594 / 4655 1
1595 / 4655 Value: soledad, california Pred: class Correct: city of license
1596 / 4655 1
1596 / 4655 Value: morro bay, california Pred: class Correct: city of license
1597 / 4655 Value: 7 Pred: rec. Correct: avg.
1597 / 4655 Value: 60 Pred: rec. Correct: long
1597 / 4655 1
1597 / 4655 Value: correll buckhalter Pred: yards Correct: player
1598 / 4655 Value: 11.8 Pred: yards Correct: avg.
1598 / 4655 Value: brent celek Pred: yards Correct: player
1598 / 4655 Value: 44 Pred: yards Correct: long
1599 / 4655 Value: 54 Pred: yards Correct: rec.
1599 / 4655 Value: 5 Pred: rec. Correct: long
1599 / 4655 Value: todd herremans Pred: None Correct: player
1599 / 4655 Value: 1 Pred: rec. Correct: avg.
1600 / 4655 Value: malacca Pred: competition Correct: opponent
1600 / 4655 Value: klfa stadium, cheras Pred: None Correct: venue
1601 / 4655 Value: city stadium, georgetown Pred: opponent Correct: venue
1602 / 4655 Value: police Pred: date Correct: opponent
1602 / 4655 1
1603 / 4655 Value: 3 Pred: points Correct: touchdowns
1603 / 4655 1
1603 / 4655 1
1604 / 4655 1
1604 / 4655 Value: 12 Pred: points Correct: extra points
1605 / 4655 Value: tracy mcgrady (24) Pred: date Correct: high points
1606 / 4655 Value: free choice Pred: song choice Correct: theme
1606 / 4655 Value: through to bootcamp Pred: theme Correct: result
1607 / 4655 Value: florida panthers Pred: game Correct: opponent
1607 / 4655 1
1608 / 4655 1
1609 / 4655 Value: gt Pred: race Correct: class
1609 / 4655 1
1610 / 4655 Value: gt Pred: race Correct: class
1610 / 4655 Value: portland international raceway Pred: race Correct: circuit
1611 / 4655 1
1612 / 4655 Value: 1,115.8 Pred: None Correct: revenue (€m)
1612 / 4655 Value: 31 december 2012 Pred: passenger load factor (%) Correct: year ended
1613 / 4655 Value: democrat Pred: incumbent Correct: party
1613 / 4655 Value: 2 Pred: status Correct: district
1613 / 4655 1
1614 / 4655 Value: ortiz Pred: champion Correct: top goalscorer
1614 / 4655 Value: 25 Pred: year Correct: goals
1615 / 4655 Value: st. louis Pred: home Correct: visitor
1616 / 4655 Value: canada Pred: nhl team Correct: nationality
1616 / 4655 Value: new york islanders Pred: college/junior/club team Correct: nhl team
1616 / 4655 1
1617 / 4655 Value: brandon wheat kings (wchl) Pred: position Correct: college/junior/club team
1618 / 4655 Value: university of wisconsin (wcha) Pred: position Correct: college/junior/club team
1618 / 4655 Value: bob lundeen Pred: nationality Correct: player
1619 / 4655 Value: brent meeke Pred: pick # Correct: player
1620 / 4655 1
1621 / 4655 Value: 26.39 Pred: pop. 2006 Correct: area 1996 km²
1621 / 4655 Value: 18,610 Pred: None Correct: pop. 2006
1622 / 4655 Value: 17,510 Pred: None Correct: pop. 1999
1622 / 4655 Value: 30 Pred: pop. 2003 Correct: area 2006 km²
1623 / 4655 Value: tampa bay Pred: streak end Correct: teams
1624 / 4655 Value: juventus Pred: season Correct: champion
1625 / 4655 Value: michael andretti Pred: fastest lap Correct: winning driver
1626 / 4655 1
1627 / 4655 Value: jimmy vasser Pred: fastest lap Correct: winning driver
1628 / 4655 Value: ken hemenway Pred: position Correct: player
1629 / 4655 Value: moño negro Pred: None Correct: track
1629 / 4655 1
1630 / 4655 1
1630 / 4655 Value: bonga sw; aparo Pred: year startup Correct: project name
1631 / 4655 1
1632 / 4655 1
1633 / 4655 Value: film Pred: role Correct: medium
1633 / 4655 Value: film classics Pred: title Correct: theatre, studio, or network
1634 / 4655 Value: film Pred: role Correct: medium
1634 / 4655 Value: 1948 Pred: title Correct: date
1634 / 4655 1
1635 / 4655 Value: reuschel (12-3) Pred: date Correct: loss
1636 / 4655 Value: new england patriots Pred: kickoff Correct: opponent
1637 / 4655 Value: $30,471 Pred: None Correct: gross (worldwide)
1638 / 4655 1
1639 / 4655 1
1640 / 4655 Value: 2 Pred: home Correct: round
1640 / 4655 1
1641 / 4655 1
1642 / 4655 1
1643 / 4655 Value: 0 Pred: total Correct: gold
1643 / 4655 Value: 0 Pred: total Correct: bronze
1643 / 4655 Value: 0 Pred: total Correct: silver
1643 / 4655 Value: 1 Pred: year Correct: sports
1644 / 4655 1
1645 / 4655 Value: chuck klein Pred: opponent Correct: player
1646 / 4655 Value: josh hamilton Pred: team Correct: player
1647 / 4655 Value: 15 Pred: release date Correct: classifaction
1648 / 4655 1
1648 / 4655 Value: n/a Pred: country Correct: classifaction
1648 / 4655 Value: spectrum dvd Pred: format Correct: publisher
1649 / 4655 Value: 32,012 Pred: None Correct: attendance
1649 / 4655 1
1649 / 4655 1
1650 / 4655 Value: cryptogramophon Pred: None Correct: label
1651 / 4655 Value: karen frohner Pred: None Correct: name
1651 / 4655 Value: 1266 Pred: name Correct: points
1652 / 4655 1
1652 / 4655 1
1653 / 4655 1
1653 / 4655 1
1654 / 4655 Value: thirst Pred: result Correct: film/series
1654 / 4655 1
1654 / 4655 Value: green globe film awards Pred: award Correct: group
1655 / 4655 Value: nominated Pred: award Correct: result
1655 / 4655 Value: thirst Pred: result Correct: film/series
1655 / 4655 1
1655 / 4655 Value: baeksang arts awards Pred: award Correct: group
1656 / 4655 1
1656 / 4655 Value: thirst Pred: result Correct: film/series
1657 / 4655 Value: over the rainbow Pred: group Correct: film/series
1658 / 4655 1
1659 / 4655 1
1660 / 4655 Value: new england revolution Pred: position Correct: mls team
1661 / 4655 1
1662 / 4655 1
1662 / 4655 Value: andrew combs Pred: week Correct: offensive
1663 / 4655 1
1664 / 4655 Value: 0:0 - 4:1 (pen) Pred: home Correct: score
1665 / 4655 Value: – Pred: season Correct: play-off
1665 / 4655 Value: 2008–09 Pred: None Correct: year
1666 / 4655 Value: fullback Pred: player Correct: position
1666 / 4655 1
1667 / 4655 1
1668 / 4655 Value: 2 Pred: date of birth (age) Correct: caps
1668 / 4655 1
1668 / 4655 Value: alberto sgarbi Pred: club/province Correct: player
1669 / 4655 Value: elisabeth of lorraine Pred: ceased to be duchess Correct: image
1670 / 4655 Value: william iv Pred: father Correct: husband
1671 / 4655 1
1672 / 4655 Value: adh2350iaa5do Pred: None Correct: part number(s)
1673 / 4655 Value: athlon x2 be-2400 Pred: None Correct: model number
1674 / 4655 Value: june 5, 2007 Pred: multi 1 Correct: release date
1675 / 4655 Value: st. louis Pred: home Correct: visitor
1675 / 4655 1
1676 / 4655 Value: philadelphia Pred: home Correct: visitor
1677 / 4655 1
1678 / 4655 Value: twins Pred: loss Correct: opponent
1678 / 4655 1
1679 / 4655 Value: devil rays Pred: loss Correct: opponent
1679 / 4655 1
1680 / 4655 Value: day 1 Pred: known for Correct: entered
1680 / 4655 1
1681 / 4655 Value: day 1 Pred: known for Correct: entered
1681 / 4655 1
1682 / 4655 Value: 29 september 1766 Pred: ceased to be queen Correct: birth
1683 / 4655 Value: 10 may 1788 Pred: marriage Correct: birth
1684 / 4655 1
1685 / 4655 1
1685 / 4655 Value: 0 Pred: total Correct: silver
1686 / 4655 Value: oakland seals Pred: date Correct: home
1687 / 4655 1
1688 / 4655 Value: 100,000 Pred: city of license Correct: watts
1688 / 4655 Value: guymon, oklahoma Pred: watts Correct: city of license
1689 / 4655 Value: 1960 rome Pred: event Correct: games
1689 / 4655 Value: men's freestyle welterweight Pred: medal Correct: event
1690 / 4655 Value: national team Pred: games Correct: name
1690 / 4655 Value: 1968 mexico city Pred: name Correct: games
1691 / 4655 1
1691 / 4655 Value: russia Pred: position Correct: nationality
1692 / 4655 Value: defenceman Pred: player Correct: position
1693 / 4655 Value: audenshaw urban district Pred: district Correct: former local authority
1694 / 4655 Value: derrick harvey Pred: college Correct: name
1694 / 4655 Value: 1 Pred: pick # Correct: round
1695 / 4655 Value: defensive end Pred: round Correct: position
1695 / 4655 Value: 2 Pred: pick # Correct: round
1696 / 4655 1
1696 / 4655 Value: 24 Pred: round Correct: pick #
1697 / 4655 1
1697 / 4655 Value: 5 Pred: pick # Correct: round
1698 / 4655 Value: 1,521 Pred: total convictions Correct: fraud (art. 146 stgb)
1698 / 4655 1
1699 / 4655 Value: tamworth Pred: home team Correct: away team
1700 / 4655 1
1700 / 4655 Value: 109–1–2 Pred: None Correct: record
1701 / 4655 Value: 10 Pred: res. Correct: rd., time
1701 / 4655 Value: sammy angott Pred: None Correct: opponent
1701 / 4655 Value: 33–0 Pred: None Correct: record
1702 / 4655 1
1703 / 4655 1
1704 / 4655 Value: 2–2 Pred: None Correct: result
1704 / 4655 Value: 5,760 Pred: venue Correct: attendance
1705 / 4655 Value: 11,045 Pred: None Correct: attendance
1706 / 4655 Value: 0–0 Pred: None Correct: 2nd leg
1706 / 4655 1
1707 / 4655 Value: cs sfaxien Pred: team 1 Correct: team 2
1708 / 4655 Value: lee janzen Pred: to par Correct: player
1709 / 4655 Value: new york jets Pred: week Correct: opponent
1710 / 4655 1
1711 / 4655 Value: flat stage Pred: winner Correct: type
1711 / 4655 1
1712 / 4655 1
1713 / 4655 Value: 1964 Pred: number of votes received Correct: election date
1714 / 4655 1
1715 / 4655 1
1716 / 4655 Value: golden state warriors Pred: game Correct: opponent
1717 / 4655 1
1718 / 4655 Value: 5 Pred: lost Correct: try bonus
1718 / 4655 Value: 517 Pred: points Correct: points for
1719 / 4655 Value: 10.9% Pred: freight (metric tonnes) Correct: % change 2005/2006
1719 / 4655 Value: 4,022 Pred: None Correct: freight (metric tonnes)
1720 / 4655 Value: st. louis cardinals Pred: attendance Correct: opponent
1720 / 4655 Value: 80,010 Pred: None Correct: attendance
1721 / 4655 Value: hayes & yeading united Pred: result Correct: opponent
1722 / 4655 1
1722 / 4655 Value: rr:08,09 Pred: None Correct: result
1723 / 4655 1
1724 / 4655 1
1724 / 4655 1
1725 / 4655 Value: 565.39 Pred: None Correct: area (km²)
1725 / 4655 Value: 23.54 Pred: population Correct: population density (per km 2 )
1726 / 4655 1
1727 / 4655 Value: 0 Pred: average Correct: int's
1728 / 4655 Value: 0 Pred: average Correct: int's
1728 / 4655 Value: randy scott Pred: int's Correct: player
1728 / 4655 Value: 3 Pred: average Correct: sacks
1729 / 4655 Value: 14 Pred: length (m) Correct: bobsleigh-skeleton curves
1729 / 4655 1
1730 / 4655 Value: h Pred: match Correct: venue
1730 / 4655 1
1730 / 4655 1
1731 / 4655 1
1732 / 4655 Value: win Pred: round Correct: res.
1732 / 4655 Value: 2 Pred: res. Correct: round
1732 / 4655 Value: makoto ishikawa Pred: round Correct: opponent
1733 / 4655 1
1734 / 4655 Value: 60/120/180/240 Pred: None Correct: capacities (gb)
1735 / 4655 Value: sandforce Pred: None Correct: controller
1735 / 4655 Value: 80/120/180/240/360/480 Pred: None Correct: capacities (gb)
1735 / 4655 1
1736 / 4655 Value: 25nm mlc-het Pred: rnd 4kb read/write iops (k) Correct: nand type
1736 / 4655 Value: 270/210 Pred: None Correct: seq. read/write mb/s
1737 / 4655 Value: sandforce Pred: None Correct: controller
1737 / 4655 Value: sierra star Pred: seq. read/write mb/s Correct: codename
1738 / 4655 Value: 12:30pm Pred: None Correct: time ( et )
1738 / 4655 Value: shea stadium Pred: week Correct: location
1739 / 4655 1
1739 / 4655 1
1739 / 4655 Value: 17 Pred: year Correct: start
1740 / 4655 Value: tokyo, japan Pred: date Correct: tournament
1740 / 4655 1
1741 / 4655 1
1741 / 4655 1
1742 / 4655 1
1743 / 4655 1
1744 / 4655 Value: st. petersburg - moscow Pred: report Correct: name
1745 / 4655 1
1746 / 4655 1
1746 / 4655 1
1747 / 4655 1
1747 / 4655 Value: 16 Pred: total Correct: gold
1748 / 4655 Value: 3 Pred: total Correct: bronze
1748 / 4655 Value: 0 Pred: total Correct: silver
1749 / 4655 1
1749 / 4655 Value: 461 Pred: losing bonus Correct: points against
1750 / 4655 1
1751 / 4655 Value: 23,394 Pred: None Correct: attendance
1752 / 4655 1
1752 / 4655 1
1753 / 4655 Value: 7 Pred: lost Correct: games
1754 / 4655 Value: 4495 Pred: None Correct: net yds
1754 / 4655 1
1754 / 4655 Value: 5.5 Pred: long Correct: yds/att
1755 / 4655 1
1755 / 4655 Value: 5 Pred: start Correct: yds/att
1755 / 4655 Value: 1 Pred: start Correct: rank
1756 / 4655 Value: 68 Pred: touchdowns Correct: long
1756 / 4655 Value: 1984 Pred: name Correct: start
1757 / 4655 Value: 3 Pred: start Correct: rank
1757 / 4655 Value: 1984 Pred: name Correct: start
1757 / 4655 Value: 6.1 Pred: touchdowns Correct: yds/att
1758 / 4655 1
1759 / 4655 Value: annabelle Pred: film Correct: role
1760 / 4655 1
1761 / 4655 Value: g1 Pred: jockey Correct: group
1761 / 4655 1
1762 / 4655 Value: december 23, 2001 Pred: result Correct: date
1763 / 4655 Value: december 2, 2001 Pred: result Correct: date
1764 / 4655 1
1765 / 4655 Value: hkg/vhhh Pred: None Correct: code (iata/icao)
1766 / 4655 Value: 3 Pred: lost Correct: points
1766 / 4655 Value: 0 Pred: points Correct: lost
1767 / 4655 Value: tiger stadium Pred: attendance Correct: game site
1767 / 4655 Value: 7 Pred: date Correct: week
1768 / 4655 1
1768 / 4655 Value: 26 Pred: year Correct: pick
1769 / 4655 1
1769 / 4655 Value: 2 Pred: year Correct: pick
1770 / 4655 1
1770 / 4655 1
1770 / 4655 1
1771 / 4655 1
1772 / 4655 Value: car Pred: vehicle Correct: class
1772 / 4655 1
1773 / 4655 Value: azeri tv tower Pred: pinnacle height Correct: name
1774 / 4655 1
1775 / 4655 Value: emley moor tower (mk.3) Pred: None Correct: name
1776 / 4655 1
1776 / 4655 Value: transmitter solt Pred: pinnacle height Correct: name
1777 / 4655 Value: 321 Pred: percentage of possible points Correct: points
1777 / 4655 1
1777 / 4655 Value: 16 Pred: percentage of possible points Correct: races
1778 / 4655 Value: honda 1000cc Pred: race Correct: machine
1778 / 4655 Value: bruce anstey Pred: average speed Correct: rider(s)
1779 / 4655 1
1780 / 4655 1
1780 / 4655 1
1780 / 4655 Value: 0 Pred: points Correct: drawn
1781 / 4655 1
1782 / 4655 Value: 0 Pred: college Correct: specialist
1783 / 4655 Value: 32 Pred: score Correct: tie no

Our accuracy statistics for this case are as follows.

*   Attribute Classification Accuracy: 38.91%
*   Percentage of queries for which the attribute for at least 1 value could not be predicted: 83.37%

# View Queries for which SELECT attributes are not explicitly present in the NLQ

In this section, we display what kind of NLQs don't have the SELECT attributes explicitly present in them so that we can come up with future ways to address these types of queries.

In [68]:
def obtain_absent_select_queries():
  """Return the queries where the SELECT attributes aren't explicitly present in the NLQ."""
  tagTestSet= []
  i = 0
  for row in tqdm(dataset['test']):
    question = row['question']
    sqlQuery = row['sql']['human_readable']
    columns = row['table']['header']
    question = remove_unicode_characters(question)
    sqlQuery = remove_unicode_characters(sqlQuery)
    sqlExtractor = sqlExtract(sqlQuery)
    addedIndicator = False
    for i in range(len(columns)):
      columns[i] = remove_unicode_characters(columns[i])
    selectAttr = sqlExtractor.fetch_select_attr()
    if is_select_not_present_in_nlq(selectAttr, question):
      tagTestSet.append({'question': question, 'sqlQuery': sqlQuery, 'attr': columns})
  print(f"\n% of NLQs where the SELECT attr is not explicitly present in the NLQ: {(len(tagTestSet)/ len(dataset['test'])) * 100}\n")
  return tagTestSet

In [69]:
obtain_absent_select_queries()

100%|██████████| 15878/15878 [00:06<00:00, 2639.12it/s]

% of NLQs where the SELECT attr is not explicitly present in the NLQ: 24.259982365537223

[{'question': 'What clu was in toronto 1995-96',
  'sqlQuery': 'SELECT School/Club Team FROM table WHERE Years in Toronto = 1995-96',
  'attr': ['Player',
   'No.',
   'Nationality',
   'Position',
   'Years in Toronto',
   'School/Club Team']},
 {'question': 'which club was in toronto 2003-06',
  'sqlQuery': 'SELECT School/Club Team FROM table WHERE Years in Toronto = 2003-06',
  'attr': ['Player',
   'No.',
   'Nationality',
   'Position',
   'Years in Toronto',
   'School/Club Team']},
 {'question': 'how many schools or teams had jalen rose',
  'sqlQuery': 'SELECT COUNT School/Club Team FROM table WHERE Player = Jalen Rose',
  'attr': ['Player',
   'No.',
   'Nationality',
   'Position',
   'Years in Toronto',
   'School/Club Team']},
 {'question': 'Where was Assen held?',
  'sqlQuery': 'SELECT Round FROM table WHERE Circuit = Assen',
  'attr': ['No',
   'Date',
   'Round',
   'Circuit',
   'Pole Position',
   'Fastest Lap',
   'Race winner',
   'Report']},
 {'question': 'What was the number of race that Kevin Curtain won?',
  'sqlQuery': 'SELECT COUNT No FROM table WHERE Pole Position = Kevin Curtain',
  'attr': ['No',
   'Date',
   'Round',
   'Circuit',
   'Pole Position',
   'Fastest Lap',
   'Race winner',
   'Report']},
 {'question': 'How many different positions did Sherbrooke Faucons (qmjhl) provide in the draft?',
  'sqlQuery': 'SELECT COUNT Position FROM table WHERE College/junior/club team = Sherbrooke Faucons (QMJHL)',
  'attr': ['Pick',
   'Player',
   'Position',
   'Nationality',
   'NHL team',
   'College/junior/club team']},
 {'question': 'What are the nationalities of the player picked from Thunder Bay Flyers (ushl)',
  'sqlQuery': 'SELECT Nationality FROM table WHERE College/junior/club team = Thunder Bay Flyers (USHL)',
  'attr': ['Pick',
   'Player',
   'Position',
   'Nationality',
   'NHL team',
   'College/junior/club team']},
 {'question': 'How many different college/junior/club teams provided a player to the Washington Capitals NHL Team?',
  'sqlQuery': 'SELECT COUNT College/junior/club team FROM table WHERE NHL team = Washington Capitals',
  'attr': ['Pick',
   'Player',
   'Position',
   'Nationality',
   'NHL team',
   'College/junior/club team']},
 {'question': 'How many different nationalities do the players of New Jersey Devils come from?',
  'sqlQuery': 'SELECT COUNT Nationality FROM table WHERE NHL team = New Jersey Devils',
  'attr': ['Pick',
   'Player',
   'Position',
   'Nationality',
   'NHL team',
   'College/junior/club team']},
 {'question': ' What could a spanish coronel be addressed as in the commonwealth military?',
  'sqlQuery': 'SELECT Commonwealth equivalent FROM table WHERE Rank in Spanish = Coronel',
  'attr': ['Equivalent NATO Rank Code',
   'Rank in Spanish',
   'Rank in English',
   'Commonwealth equivalent',
   'US Air Force equivalent']},
 {'question': 'Give me a list of all spanish officer titles that could receive recognition as group captain in english',
  'sqlQuery': 'SELECT Rank in English FROM table WHERE Commonwealth equivalent = Group Captain',
  'attr': ['Equivalent NATO Rank Code',
   'Rank in Spanish',
   'Rank in English',
   'Commonwealth equivalent',
   'US Air Force equivalent']},
 {'question': 'If you are a pilot officer in the commonwealth then what will you called as in the US air force?',
  'sqlQuery': 'SELECT US Air Force equivalent FROM table WHERE Commonwealth equivalent = Pilot Officer',
  'attr': ['Equivalent NATO Rank Code',
   'Rank in Spanish',
   'Rank in English',
   'Commonwealth equivalent',
   'US Air Force equivalent']},
 {'question': "If you're a major general in the US air force then what ranking will you receive in the commonwealth's air force?",
  'sqlQuery': 'SELECT Commonwealth equivalent FROM table WHERE US Air Force equivalent = Major General',
  'attr': ['Equivalent NATO Rank Code',
   'Rank in Spanish',
   'Rank in English',
   'Commonwealth equivalent',
   'US Air Force equivalent']},
 {'question': 'If you get a ranking as major in the  english military then what would the spanish military address you as? ',
  'sqlQuery': 'SELECT Rank in Spanish FROM table WHERE Rank in English = Major',
  'attr': ['Equivalent NATO Rank Code',
   'Rank in Spanish',
   'Rank in English',
   'Commonwealth equivalent',
   'US Air Force equivalent']},
 {'question': 'Which wrestlers have had 2 reigns?',
  'sqlQuery': 'SELECT Wrestler FROM table WHERE # of reigns = 2',
  'attr': ['Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank.',
   'Wrestler',
   '# of reigns',
   'Combined defenses',
   'Combined days']},
 {'question': 'In terms of reigns, what is the lowest number listed?',
  'sqlQuery': 'SELECT MIN # of reigns FROM table',
  'attr': ['Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank.',
   'Wrestler',
   '# of reigns',
   'Combined defenses',
   'Combined days']},
 {'question': 'What rank was Bryan Danielson in this chart?',
  'sqlQuery': 'SELECT Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank. FROM table WHERE Wrestler = Bryan Danielson',
  'attr': ['Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank.',
   'Wrestler',
   '# of reigns',
   'Combined defenses',
   'Combined days']},
 {'question': "What was Go Shiozaki's rank?",
  'sqlQuery': 'SELECT MIN Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank. FROM table WHERE Wrestler = Go Shiozaki',
  'attr': ['Rank Each wrestlers total number of days as champion are ranked highest to lowest; wrestlers with the same number mean that they are tied for that certain rank.',
   'Wrestler',
   '# of reigns',
   'Combined defenses',
   'Combined days']},
 {'question': 'What is the regulated retail price for the tariff code ff0 prs?',
  'sqlQuery': 'SELECT BTs retail price (regulated) FROM table WHERE Tariff code = ff0 PRS',
  'attr': ['Scheme',
   'Tariff code',
   'BTs retail price (regulated)',
   'Approx premium',
   'Prefixes']},
 {'question': 'What is the premium associated with tariff code g9?',
  'sqlQuery': 'SELECT Approx premium FROM table WHERE Tariff code = g9',
  'attr': ['Scheme',
   'Tariff code',
   'BTs retail price (regulated)',
   'Approx premium',
   'Prefixes']},
 {'question': 'How many tariff codes have a bts retail price of 2p/min or inclusive?',
  'sqlQuery': 'SELECT COUNT Tariff code FROM table WHERE BTs retail price (regulated) = 2p/min or inclusive',
  'attr': ['Scheme',
   'Tariff code',
   'BTs retail price (regulated)',
   'Approx premium',
   'Prefixes']},
 {'question': 'How many tariff codes have a bts retail price of 2.553p/min?',
  'sqlQuery': 'SELECT COUNT Tariff code FROM table WHERE BTs retail price (regulated) = 2.553p/min',
  'attr': ['Scheme',
   'Tariff code',
   'BTs retail price (regulated)',
   'Approx premium',
   'Prefixes']},
 {'question': 'What is the tone for gen.sing. plague?',
  'sqlQuery': 'SELECT Tone (Latvian notation: /~/ - level, /^/ - broken) FROM table WHERE Translation = Gen.Sing. plague',
  'attr': ['Nominative',
   'Old orthography',
   'New orthography',
   '/e/ or /æ/ (IPA)',
   'Tone (Latvian notation: /~/ - level, /^/ - broken)',
   'Translation']},
 {'question': 'What is the smallest possible radius?',
  'sqlQuery': 'SELECT MIN Radius (R ☉ ) FROM table',
  'attr': ['Star (Pismis24-#)',
   'Spectral type',
   'Magnitude (M bol )',
   'Temperature (K)',
   'Radius (R ☉ )',
   'Mass (M ☉ )']},
 {'question': 'What are all the spectral types for star mismis24-# is 1sw?',
  'sqlQuery': 'SELECT Spectral type FROM table WHERE Star (Pismis24-#) = 1SW',
  'attr': ['Star (Pismis24-#)',
   'Spectral type',
   'Magnitude (M bol )',
   'Temperature (K)',
   'Radius (R ☉ )',
   'Mass (M ☉ )']},
 {'question': 'If a radius is 10, what  is the lowest possible mass?',
  'sqlQuery': 'SELECT MIN Mass (M ☉ ) FROM table WHERE Radius (R ☉ ) = 10',
  'attr': ['Star (Pismis24-#)',
   'Spectral type',
   'Magnitude (M bol )',
   'Temperature (K)',
   'Radius (R ☉ )',
   'Mass (M ☉ )']},
 {'question': 'What percentage of seats were filled in 2006?',
  'sqlQuery': 'SELECT Seat factor FROM table WHERE Year = 2006',
  'attr': ['Year',
   'Aircraft kilometers',
   'Departures',
   'Flying hours',
   'Passengers',
   'Seat factor',
   'Employees',
   'Profit/loss']},
 {'question': 'How many hours were flown in each of the years where more than 64379058.0 kilometers were flown?',
  'sqlQuery': 'SELECT Flying hours FROM table WHERE Aircraft kilometers > 64379058.0',
  'attr': ['Year',
   'Aircraft kilometers',
   'Departures',
   'Flying hours',
   'Passengers',
   'Seat factor',
   'Employees',
   'Profit/loss']},
 {'question': 'How many significant relationships list Will as a virtue?',
  'sqlQuery': 'SELECT COUNT Significant Relationship FROM table WHERE Virtues = Will',
  'attr': ['Approximate Age',
   'Virtues',
   'Psycho Social Crisis',
   'Significant Relationship',
   'Existential Question [ not in citation given ]',
   'Examples']},
 {'question': 'How many countries got 796.7 points?',
  'sqlQuery': 'SELECT COUNT Rank FROM table WHERE Points = 796.7',
  'attr': ['Rank',
   'Member Association',
   'Points',
   'Group stage',
   'Play-off',
   'AFC Cup']},
 {'question': 'What is the lowest group to earn 886.6 points?',
  'sqlQuery': 'SELECT MIN Group stage FROM table WHERE Points = 886.6',
  'attr': ['Rank',
   'Member Association',
   'Points',
   'Group stage',
   'Play-off',
   'AFC Cup']},
 {'question': 'How many countries earned 177.2 points?',
  'sqlQuery': 'SELECT COUNT Member Association FROM table WHERE Points = 177.2',
  'attr': ['Rank',
   'Member Association',
   'Points',
   'Group stage',
   'Play-off',
   'AFC Cup']},
 {'question': 'What country had the total 18,900 (r)?',
  'sqlQuery': 'SELECT County FROM table WHERE Total = 18,900 (R)',
  'attr': ['County',
   'Precincts',
   'Lunsford',
   '% Lunsford',
   'McConnell',
   '% McConnell',
   'Total']},
 {'question': 'When % mcconnell is 44.54% what are the total number of counties?',
  'sqlQuery': 'SELECT COUNT County FROM table WHERE % McConnell = 44.54%',
  'attr': ['County',
   'Precincts',
   'Lunsford',
   '% Lunsford',
   'McConnell',
   '% McConnell',
   'Total']},
 {'question': 'When did the stadium where Bursaspor is the tenant open?',
  'sqlQuery': 'SELECT MIN Opening FROM table WHERE Tenant = Bursaspor',
  'attr': ['Stadium', 'Capacity', 'City', 'Country', 'Tenant', 'Opening']},
 {'question': 'How many tenants are there in the city of Samsun?',
  'sqlQuery': 'SELECT COUNT Tenant FROM table WHERE City = Samsun',
  'attr': ['Stadium', 'Capacity', 'City', 'Country', 'Tenant', 'Opening']},
 {'question': 'What is the state of Ted Stevens?',
  'sqlQuery': 'SELECT State represented FROM table WHERE Name = Ted Stevens',
  'attr': ['Total tenure rank',
   'Uninterrupted rank',
   'Name',
   'State represented',
   'Dates of service',
   'Total tenure time',
   'Uninterrupted time']},
 {'question': 'What religious groups made up 0.72% of the Indian population in 2001?',
  'sqlQuery': 'SELECT Religious group FROM table WHERE Population % 2001 = 0.72%',
  'attr': ['Religious group',
   'Population % 1961',
   'Population % 1971',
   'Population % 1981',
   'Population % 1991',
   'Population % 2001']},
 {'question': 'How many episodes in season 6 titles "Poppin\' Tags"?',
  'sqlQuery': 'SELECT COUNT No. in season FROM table WHERE Title = "Poppin\' Tags"',
  'attr': ['No. in series',
   'No. in season',
   'Title',
   'Directed by',
   'Written by',
   'Original air date',
   'U.S. viewers (millions)']},
 {'question': 'How many drivers on the williams team had a margin of defeat of 2?',
  'sqlQuery': 'SELECT COUNT Driver FROM table WHERE Team = Williams AND Margin of defeat = 2',
  'attr': ['Season',
   'Driver',
   'Team',
   'Engine',
   'Poles',
   'Wins',
   'Podiums',
   'Points',
   'Margin of defeat']},
 {'question': 'How many seasons was clay regazzoni the driver?',
  'sqlQuery': 'SELECT COUNT Season FROM table WHERE Driver = Clay Regazzoni',
  'attr': ['Season',
   'Driver',
   'Team',
   'Engine',
   'Poles',
   'Wins',
   'Podiums',
   'Points',
   'Margin of defeat']},
 {'question': 'Which margin of defeats had points of 30?',
  'sqlQuery': 'SELECT Margin of defeat FROM table WHERE Points = 30',
  'attr': ['Season',
   'Driver',
   'Team',
   'Engine',
   'Poles',
   'Wins',
   'Podiums',
   'Points',
   'Margin of defeat']},
 {'question': 'How many people were pick #30?',
  'sqlQuery': 'SELECT COUNT Position FROM table WHERE Pick # = 30',
  'attr': ['Pick #', 'CFL Team', 'Player', 'Position', 'College']},
 {'question': 'Which lava domes erupted or had a growth episode during the Holocene period?',
  'sqlQuery': 'SELECT Name of lava dome FROM table WHERE Last eruption or growth episode = Holocene',
  'attr': ['Name of lava dome',
   'Country',
   'Volcanic area',
   'Composition',
   'Last eruption or growth episode']},
 {'question': 'How many countries are the Tata Sabaya Lava domes located in?',
  'sqlQuery': 'SELECT COUNT Country FROM table WHERE Name of lava dome = Tata Sabaya lava domes',
  'attr': ['Name of lava dome',
   'Country',
   'Volcanic area',
   'Composition',
   'Last eruption or growth episode']},
 {'question': 'What countries have had eruptions of growth episodes in 1986?',
  'sqlQuery': 'SELECT Country FROM table WHERE Last eruption or growth episode = 1986',
  'attr': ['Name of lava dome',
   'Country',
   'Volcanic area',
   'Composition',
   'Last eruption or growth episode']},
 {'question': 'What is the highest track number?',
  'sqlQuery': 'SELECT MAX Track # FROM table',
  'attr': ['Track #',
   'Song',
   'Singers',
   'Picturization',
   'Length',
   'Lyricist']},
 {'question': 'What publishers were involved with product number SCUS-97265?',
  'sqlQuery': 'SELECT Publisher FROM table WHERE Product No. = SCUS-97265',
  'attr': ['Title',
   'System',
   'Publisher',
   'Product No.',
   'Compatible with 20/60GB NTSC PS3 (CECHA/CECHB)',
   'Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE)']},
 {'question': 'How many products have the title "Jak 3"?',
  'sqlQuery': 'SELECT COUNT Product No. FROM table WHERE Title = Jak 3',
  'attr': ['Title',
   'System',
   'Publisher',
   'Product No.',
   'Compatible with 20/60GB NTSC PS3 (CECHA/CECHB)',
   'Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE)']},
 {'question': 'Which James Bond 007: Agent Under Fire from Electronic Arts is compatible with 60 gb pal/80 gb NTSC PS3 (CECHC/CECHE)?',
  'sqlQuery': 'SELECT Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE) FROM table WHERE Publisher = Electronic Arts AND Title = James Bond 007: Agent Under Fire',
  'attr': ['Title',
   'System',
   'Publisher',
   'Product No.',
   'Compatible with 20/60GB NTSC PS3 (CECHA/CECHB)',
   'Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE)']},
 {'question': 'What publishers produce product number SLUS-20265?',
  'sqlQuery': 'SELECT Publisher FROM table WHERE Product No. = SLUS-20265',
  'attr': ['Title',
   'System',
   'Publisher',
   'Product No.',
   'Compatible with 20/60GB NTSC PS3 (CECHA/CECHB)',
   'Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE)']},
 {'question': 'How many titles have the product number SCUS-97330?',
  'sqlQuery': 'SELECT COUNT Title FROM table WHERE Product No. = SCUS-97330',
  'attr': ['Title',
   'System',
   'Publisher',
   'Product No.',
   'Compatible with 20/60GB NTSC PS3 (CECHA/CECHB)',
   'Compatible with 60GB PAL/80GB NTSC PS3 (CECHC/CECHE)']},
 {'question': 'How many series are named "Lockdown"?',
  'sqlQuery': 'SELECT COUNT Series # FROM table WHERE Title = "Lockdown"',
  'attr': ['Series #',
   'Episode #',
   'Title',
   'Directed by',
   'Written by',
   'Original air date']},
 {'question': 'Who directed the second episode of "The Homecoming" which was written by Tommy Thompson?',
  'sqlQuery': 'SELECT Directed by FROM table WHERE Written by = Tommy Thompson',
  'attr': ['Series #',
   'Episode #',
   'Title',
   'Directed by',
   'Written by',
   'Original air date']},
 {'question': 'What was the latest episode of "House of Cards"?',
  'sqlQuery': 'SELECT MAX Episode # FROM table WHERE Title = "House of Cards"',
  'attr': ['Series #',
   'Episode #',
   'Title',
   'Directed by',
   'Written by',
   'Original air date']},
 {'question': 'Who was the republican candidate in 2013 when Staten Island was 451?',
  'sqlQuery': 'SELECT 2013 Republican primary FROM table WHERE Staten Island = 451',
  'attr': ['2013 Republican primary',
   'Manhattan',
   'The Bronx',
   'Brooklyn',
   'Queens',
   'Staten Island',
   'Total',
   '%']},
 {'question': 'The candidate who received 133 votes in the Bronx won what percentage overall?',
  'sqlQuery': 'SELECT % FROM table WHERE The Bronx = 133',
  'attr': ['1921',
   'party',
   'Manhattan',
   'The Bronx',
   'Brooklyn',
   'Queens',
   'Richmond [Staten Is.]',
   'Total',
   '%']},
 {'question': 'The man who received 87,676 votes in Queens won what percentage of the total for the election?',
  'sqlQuery': 'SELECT % FROM table WHERE Queens = 87,676',
  'attr': ['1921',
   'party',
   'Manhattan',
   'The Bronx',
   'Brooklyn',
   'Queens',
   'Richmond [Staten Is.]',
   'Total',
   '%']},
 {'question': 'How many parties received 29.9% of the vote in Manhattan?',
  'sqlQuery': 'SELECT COUNT party FROM table WHERE Manhattan = 29.9%',
  'attr': ['1921',
   'party',
   'Manhattan',
   'The Bronx',
   'Brooklyn',
   'Queens',
   'Richmond [Staten Is.]',
   'Total',
   '%']},
 {'question': 'What is the least september 1943 when late 1943 is 78000',
  'sqlQuery': 'SELECT MIN Sept. 1943 FROM table WHERE Late 1943 = 78000',
  'attr': ['! Late 1941',
   'Late 1942',
   'Sept. 1943',
   'Late 1943',
   'Late 1944',
   '1978 Veteran membership']},
 {'question': 'What is the late 1941 when 1978 veteran membership is 20000',
  'sqlQuery': 'SELECT ! Late 1941 FROM table WHERE 1978 Veteran membership = 20000',
  'attr': ['! Late 1941',
   'Late 1942',
   'Sept. 1943',
   'Late 1943',
   'Late 1944',
   '1978 Veteran membership']},
 {'question': 'Which stadiums have a capacity of 51082?',
  'sqlQuery': 'SELECT Stadium FROM table WHERE Capacity = 51082',
  'attr': ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average']},
 {'question': 'How many stadiums are there with a capacity of 7500?',
  'sqlQuery': 'SELECT COUNT Stadium FROM table WHERE Capacity = 7500',
  'attr': ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average']},
 {'question': 'Which stadiums have an average attendance of 13840?',
  'sqlQuery': 'SELECT Stadium FROM table WHERE Average = 13840',
  'attr': ['Team', 'Stadium', 'Capacity', 'Lowest', 'Highest', 'Average']},
 {'question': 'During the 2013 debut, what is the w-I(total) number?',
  'sqlQuery': 'SELECT COUNT W-L (Total) FROM table WHERE Debut = 2013',
  'attr': ['Player',
   'W-L (Total)',
   'W-L ( Singles )',
   'W-L ( Doubles )',
   'Ties',
   'Debut',
   'Years Played']},
 {'question': 'how many studios have the catalog number "cal03 / 0091037137333"?',
  'sqlQuery': 'SELECT COUNT Studio FROM table WHERE Catalog Number = CAL03 / 0091037137333',
  'attr': ['Year',
   'Title',
   'Format',
   'Studio',
   'Release Date',
   'Copyright Information',
   'Catalog Number']},
 {'question': 'how many titles have the name "quick callanetics"?',
  'sqlQuery': 'SELECT COUNT Catalog Number FROM table WHERE Title = Quick Callanetics',
  'attr': ['Year',
   'Title',
   'Format',
   'Studio',
   'Release Date',
   'Copyright Information',
   'Catalog Number']},

We found that about 24% of the queries in the test split do not have the SELECT attributes explicitly present in them. We have discussed potential ways to address these types of queries in our report's Future Work section.